DROP TABLE IF EXISTS `ci_account`;
CREATE TABLE `ci_account` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT COMMENT '导航栏目',
  `name` varchar(20) COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目名称',
  `number` varchar(15) COLLATE utf8_unicode_ci DEFAULT '0',
  `status` tinyint(1) DEFAULT '1' COMMENT '状态',
  `amount` double DEFAULT '0',
  `date` date DEFAULT NULL,
  `type` tinyint(1) DEFAULT '1',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `number` (`number`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of ci_account
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_account_info`
-- ----------------------------
DROP TABLE IF EXISTS `ci_account_info`;
CREATE TABLE `ci_account_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `iid` int(11) DEFAULT '0' COMMENT '关联ID',
  `buId` smallint(6) DEFAULT '0' COMMENT '客户ID',
  `billNo` varchar(25) DEFAULT '' COMMENT '销售单号',
  `billType` varchar(20) DEFAULT '',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `accId` int(11) DEFAULT '0' COMMENT '结算账户ID',
  `payment` double DEFAULT '0' COMMENT '收款金额  采购退回为正',
  `wayId` int(11) DEFAULT '0' COMMENT '结算方式ID',
  `settlement` varchar(50) DEFAULT '' COMMENT '结算号',
  `remark` varchar(50) DEFAULT '' COMMENT '备注',
  `transType` int(11) DEFAULT '0',
  `transTypeName` varchar(50) DEFAULT '',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `billdate` (`billDate`) USING BTREE,
  KEY `iid` (`iid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_account_info
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_address`
-- ----------------------------
DROP TABLE IF EXISTS `ci_address`;
CREATE TABLE `ci_address` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT COMMENT '导航栏目',
  `shortName` varchar(20) COLLATE utf8_unicode_ci DEFAULT '' COMMENT ' ',
  `postalcode` varchar(50) COLLATE utf8_unicode_ci DEFAULT '',
  `province` varchar(50) COLLATE utf8_unicode_ci DEFAULT '',
  `city` varchar(50) COLLATE utf8_unicode_ci DEFAULT '',
  `area` varchar(50) COLLATE utf8_unicode_ci DEFAULT '',
  `address` varchar(50) COLLATE utf8_unicode_ci DEFAULT '',
  `linkman` varchar(50) COLLATE utf8_unicode_ci DEFAULT '',
  `phone` varchar(20) COLLATE utf8_unicode_ci DEFAULT '',
  `mobile` varchar(20) COLLATE utf8_unicode_ci DEFAULT '',
  `isdefault` tinyint(1) DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `pid` (`postalcode`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of ci_address
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_admin`
-- ----------------------------
DROP TABLE IF EXISTS `ci_admin`;
CREATE TABLE `ci_admin` (
  `uid` smallint(6) NOT NULL AUTO_INCREMENT,
  `username` varchar(20) COLLATE utf8_unicode_ci DEFAULT '' COMMENT '用户名称',
  `userpwd` varchar(32) COLLATE utf8_unicode_ci DEFAULT '' COMMENT '密码',
  `status` tinyint(1) DEFAULT '1' COMMENT '是否锁定',
  `name` varchar(25) COLLATE utf8_unicode_ci DEFAULT '',
  `mobile` varchar(20) COLLATE utf8_unicode_ci DEFAULT '',
  `lever` text COLLATE utf8_unicode_ci COMMENT '权限',
  `roleid` tinyint(1) DEFAULT '1' COMMENT '角色ID',
  `rightids` varchar(255) COLLATE utf8_unicode_ci DEFAULT '1,2,4,8',
  `righttype1` text COLLATE utf8_unicode_ci,
  `righttype2` text COLLATE utf8_unicode_ci,
  `righttype3` text COLLATE utf8_unicode_ci,
  `righttype4` text COLLATE utf8_unicode_ci,
  `righttype8` text COLLATE utf8_unicode_ci,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of ci_admin
-- ----------------------------
INSERT INTO `ci_admin` VALUES ('1', 'admin', 'e10adc3949ba59abbe56e057f20f883e', '1', '管理员', '', null, '0', '', null, null, null, null, null);

-- ----------------------------
-- Table structure for `ci_assistingprop`
-- ----------------------------
DROP TABLE IF EXISTS `ci_assistingprop`;
CREATE TABLE `ci_assistingprop` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT COMMENT '导航栏目',
  `name` varchar(20) COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目名称',
  `disable` tinyint(1) DEFAULT '0' COMMENT '状态',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of ci_assistingprop
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_assistsku`
-- ----------------------------
DROP TABLE IF EXISTS `ci_assistsku`;
CREATE TABLE `ci_assistsku` (
  `skuId` int(11) NOT NULL AUTO_INCREMENT,
  `skuClassId` int(11) DEFAULT '0',
  `skuAssistId` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `skuName` varchar(100) COLLATE utf8_unicode_ci DEFAULT '',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`skuId`),
  KEY `id` (`skuClassId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of ci_assistsku
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_category`
-- ----------------------------
DROP TABLE IF EXISTS `ci_category`;
CREATE TABLE `ci_category` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT COMMENT '导航栏目',
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目名称',
  `code` varchar(50) DEFAULT '',
  `parentId` smallint(6) DEFAULT '0' COMMENT '上级栏目ID',
  `path` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目路径',
  `level` tinyint(2) DEFAULT '1' COMMENT '层次',
  `ordnum` int(11) DEFAULT '0' COMMENT '排序',
  `status` tinyint(1) DEFAULT '1' COMMENT '状态',
  `typeNumber` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '区别',
  `remark` text,
  `detail` tinyint(4) DEFAULT '1',
  `sortIndex` smallint(6) DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `parentId` (`parentId`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8205 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_category
-- ----------------------------
INSERT INTO `ci_category` VALUES ('1', '货物', '1000000000000000000', '0', '1', '1', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2000', '金属及非金属制品', '1080000000000000000', '1', '1,2000', '2', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2001', '非金属矿物制品', '1080100000000000000', '2000', '1,2000,2001', '3', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2002', '水泥熟料及水泥', '1080101000000000000', '2001', '1,2000,2001,2002', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2003', '硅酸盐水泥熟料', '1080101010000000000', '2002', '1,2000,2001,2002,2003', '5', '0', '1', 'trade', '即波特兰水泥熟料（简称水泥熟料），是一种由主要含CaO、SiO2、Al2O3、Fe2O3的原料按适当配比磨成细粉烧至部分熔融，所得以硅酸钙为主要矿物成分的水硬性胶凝物质；包括企业自产自用的水泥熟料和外销水泥熟料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2004', '水泥', '1080101020000000000', '2002', '1,2000,2001,2002,2004', '5', '0', '1', 'trade', '凡细磨成粉末状，加入适量水后，可成为塑性胶体，既能在空气中硬化，又能在水中硬化，并能把砂、石等材料牢固的胶结在一起的水硬性胶凝材料统称为水泥；水泥的种类很多，常用的是通用硅酸盐水泥', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2005', '石灰和石膏', '1080102000000000000', '2001', '1,2000,2001,2005', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2006', '石灰', '1080102010000000000', '2005', '1,2000,2001,2005,2006', '5', '0', '1', 'trade', '不同化学组成和物理形态的生石灰、消石灰、水硬性石灰与气硬性石灰的统称', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2007', '熟石膏', '1080102020000000000', '2005', '1,2000,2001,2005,2007', '5', '0', '1', 'trade', '石膏经低温煅烧所得到的以β半水硫酸钙为主要成分、不预加任何外加剂的粉状胶凝材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2008', '水泥混凝土制品', '1080103000000000000', '2001', '1,2000,2001,2008', '4', '0', '1', 'trade', '指水泥、混凝土制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2009', '商品混凝土', '1080103010000000000', '2008', '1,2000,2001,2008,2009', '5', '0', '1', 'trade', '混凝土是指用水泥作胶凝材料，砂、石作集料，与水（加或不加外加剂和掺合料）按一定比例配合，经搅拌、成型、养护而得的水泥混凝土，也称普通混凝土；它广泛应用于土木工程', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2010', '水泥混凝土排水管', '1080103020000000000', '2008', '1,2000,2001,2008,2010', '5', '0', '1', 'trade', '又称下水管，用于建设排除污水、雨水的下水道，排水管在生产时夹入钢筋的称钢筋混凝土排水管，不夹钢筋的称无筋混凝土排水管', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2011', '水泥混凝土压力管', '1080103030000000000', '2008', '1,2000,2001,2008,2011', '5', '0', '1', 'trade', '以钢筋混凝土为原料生产的，按照质量标准要求，可以承受一定的内压力，用于输送自来水、各种气体、石油的管道，按其生产时所用方法或原料不同，可分为预应力钢筋混凝土管和自应力钢筋混凝土管、普通钢筋混凝土管；包括水泥输水管、水泥输气管和水泥输油管', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2012', '钢筋混凝土井管、烟道管，相关钢筋混凝土管', '1080103040000000000', '2008', '1,2000,2001,2008,2012', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2013', '水泥混凝土电杆', '1080103050000000000', '2008', '1,2000,2001,2008,2013', '5', '0', '1', 'trade', '按生产时配入钢筋的方法可分为预应力钢筋混凝土电杆和普通钢筋混凝土电杆以及簿壁轻型钢筋混凝土电杆，按其横截面形状可分为环形、矩型、工字型、双肢型等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2014', '预应力混凝土桩', '1080103060000000000', '2008', '1,2000,2001,2008,2014', '5', '0', '1', 'trade', '为加强建筑物基础而打入地下的一种混凝土制品；包括预应力混凝土管桩、方桩等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2015', '混凝土轨枕及铁道用混凝土制品', '1080103070000000000', '2008', '1,2000,2001,2008,2015', '5', '0', '1', 'trade', '包括预应力混凝土水泥轨枕、气垫火车导轨体段、预应力混凝土桥枕、岔枕、混凝土轨道板\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2016', '水泥混凝土预制构件', '1080103080000000000', '2008', '1,2000,2001,2008,2016', '5', '0', '1', 'trade', '指建筑房屋用的各种梁、柱、板、楼梯等钢筋混凝土预制构件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2017', '水泥混凝土制砖、瓦及类似品', '1080103090000000000', '2008', '1,2000,2001,2008,2017', '5', '0', '1', 'trade', '包括水泥混凝土砖、水泥混凝土瓦、混凝土路缘石、混凝土界石、墓碑及类似品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2018', '纤维增强水泥制品', '1080103100000000000', '2008', '1,2000,2001,2008,2018', '5', '0', '1', 'trade', '包括石棉水泥制品、纤维增强硅酸钙板、GRC水泥制品等\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2019', '其他水泥混凝土制品', '1080103990000000000', '2008', '1,2000,2001,2008,2019', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2020', '轻质建筑材料及制品', '1080104000000000000', '2001', '1,2000,2001,2020', '4', '0', '1', 'trade', '指石膏板、石膏制品及类似轻质建筑材料的制造', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2021', '石膏板', '1080104010000000000', '2020', '1,2000,2001,2020,2021', '5', '0', '1', 'trade', '包括纸面石膏板、石膏空心条板和其他石膏板', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2022', '纸面石膏板', '1080104010100000000', '2021', '1,2000,2001,2020,2021,2022', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2023', '石膏空心条板', '1080104010200000000', '2021', '1,2000,2001,2020,2021,2023', '6', '0', '1', 'trade', '以建筑石膏为基材，掺以无机轻集料、无机纤维增强材料而制成的空心条板', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2024', '其他石膏板', '1080104010300000000', '2021', '1,2000,2001,2020,2021,2024', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2025', '石膏龙骨，相关石膏制品', '1080104020000000000', '2020', '1,2000,2001,2020,2025', '5', '0', '1', 'trade', '包括石膏龙骨、相关石膏制品，不包括石膏砌块（详见10801050305）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2026', '轻质隔墙条板', '1080104030000000000', '2020', '1,2000,2001,2020,2026', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2027', '蒸压加气混凝土板', '1080104030100000000', '2026', '1,2000,2001,2020,2026,2027', '6', '0', '1', 'trade', '以硅质材料和钙质材料为主要原料，以铝粉为发泡剂，配以经防腐处理的钢筋网片，经加水搅拌、浇注成型、预养切割、蒸压养护制成的多孔板材，不包括加气混凝土砌块（详见108010503）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2028', '建筑用轻质隔墙条板', '1080104030200000000', '2026', '1,2000,2001,2020,2026,2028', '6', '0', '1', 'trade', '由无害化磷石膏、轻质钢渣、粉煤灰等多种工业废渣组成，经变频蒸汽加压养护而成。内层装有合理布局的隔热、吸声的无机发泡型材或其他保温材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2029', '外墙外保温系统用钢丝网架模塑聚苯乙烯板', '1080104030300000000', '2026', '1,2000,2001,2020,2026,2029', '6', '0', '1', 'trade', '以工厂自动化设备生产的双面或单面钢丝网架为骨架，EPS为绝热材料，用于现浇混凝土建筑、砌体建筑及既有建筑外墙外保温系统的钢丝网架EPS板', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2030', '纤维增强硅酸钙板', '1080104030400000000', '2026', '1,2000,2001,2020,2026,2030', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2031', '玻璃纤维增强水泥轻质多孔隔墙条板', '1080104030500000000', '2026', '1,2000,2001,2020,2026,2031', '6', '0', '1', 'trade', '以耐碱玻璃纤维与硫铝酸盐水泥为主要原料的预制非承重轻质多孔内隔墙条扳', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2032', '建筑用金属面绝热夹芯板', '1080104030600000000', '2026', '1,2000,2001,2020,2026,2032', '6', '0', '1', 'trade', '以双金属面和粘接于两金属面之间的绝热夹芯材组成的自支撑的复合板材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2033', '中空钢网内模隔墙', '1080104030700000000', '2026', '1,2000,2001,2020,2026,2033', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2034', '建筑隔墙用保温条板', '1080104030800000000', '2026', '1,2000,2001,2020,2026,2034', '6', '0', '1', 'trade', '由无害化磷石膏、轻质钢渣、粉煤灰等多种工业废渣组成，经变频蒸汽加压养护而成。内层装有合理布局的隔热、吸声的无机发泡型材或其他保温材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2035', '预制复合墙板（体）', '1080104030900000000', '2026', '1,2000,2001,2020,2026,2035', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2036', '聚氨酯硬泡复合板', '1080104031000000000', '2026', '1,2000,2001,2020,2026,2036', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2037', '专用聚氨酯建筑墙体', '1080104031100000000', '2026', '1,2000,2001,2020,2026,2037', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2038', '纤维增强低碱度水泥建筑平板', '1080104031200000000', '2026', '1,2000,2001,2020,2026,2038', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2039', '维纶纤维增强水泥平板', '1080104031300000000', '2026', '1,2000,2001,2020,2026,2039', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2040', '纤维水泥平板', '1080104031400000000', '2026', '1,2000,2001,2020,2026,2040', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2041', '其他轻质隔墙条板', '1080104039900000000', '2026', '1,2000,2001,2020,2026,2041', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2042', '轻骨料，相关轻质建筑材料', '1080104040000000000', '2020', '1,2000,2001,2020,2042', '5', '0', '1', 'trade', '包括天然轻骨料、人工轻骨料、轻钢龙骨', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2043', '砖瓦及建筑砌块', '1080105000000000000', '2001', '1,2000,2001,2043', '4', '0', '1', 'trade', '用粘土和其他原材料生产的砖、瓦和建筑砌块', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2044', '砖', '1080105010000000000', '2043', '1,2000,2001,2043,2044', '5', '0', '1', 'trade', '包括烧结粘土砖、蒸压砖、蒸养砖、碳化灰砂砖、免烧砖和其他转', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2045', '烧结普通砖', '1080105010100000000', '2044', '1,2000,2001,2043,2044,2045', '6', '0', '1', 'trade', '指实心粘土砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2046', '非粘土烧结多孔砖', '1080105010200000000', '2044', '1,2000,2001,2043,2044,2046', '6', '0', '1', 'trade', '利用页岩、煤矸石、粉煤灰、淤泥、硅藻土等非粘土材料为主要原料烧结的多孔砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2047', '非粘土烧结空心砖', '1080105010300000000', '2044', '1,2000,2001,2043,2044,2047', '6', '0', '1', 'trade', '利用页岩、煤矸石、粉煤灰、淤泥、硅藻土等非粘土材料为主要原料烧结的空心砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2048', '烧结空心砌块', '1080105010400000000', '2044', '1,2000,2001,2043,2044,2048', '6', '0', '1', 'trade', '指以粘土、页岩、煤矸石为主要原料，经焙烧而成的主要用于非承重部位的空心砌块。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2049', '烧结多孔砌块', '1080105010500000000', '2044', '1,2000,2001,2043,2044,2049', '6', '0', '1', 'trade', '指以粘土、页岩、煤矸石为主要原料，经焙烧而成的主要用于承重部位的多孔砌块', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2050', '承重混凝土多孔砖', '1080105010600000000', '2044', '1,2000,2001,2043,2044,2050', '6', '0', '1', 'trade', '指以水泥、砂、石为主要原料，经配料、搅拌、成型、养护制成，用于承重结构的多排孔混凝土砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2051', '非承重混凝土空心砖', '1080105010700000000', '2044', '1,2000,2001,2043,2044,2051', '6', '0', '1', 'trade', '指以水泥、集料为主要原材料，可掺入外加剂及其他材料经配料、搅拌、成型、养护制成的空心率不小于25%，用于非承重结构部位的砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2052', '蒸压粉煤灰多孔砖', '1080105010800000000', '2044', '1,2000,2001,2043,2044,2052', '6', '0', '1', 'trade', '指采用粉煤灰、磨细石灰、石膏与泡沫剂拌合成型，经蒸压养护而成的一种轻质多孔墙体材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2053', '蒸压泡沫混凝土砖', '1080105010900000000', '2044', '1,2000,2001,2043,2044,2053', '6', '0', '1', 'trade', '指采用发泡剂通过机械制备泡沫，将优质不易破裂的泡沫强制加入到水泥基胶凝材料、集料、掺合料、外加剂和水拌合的混合料内，形成具有微气泡结构的轻质料浆，经浇注成型后再进行蒸压反应等工序而制作成的微孔硅酸盐制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2054', '烧结多孔砖', '1080105011000000000', '2044', '1,2000,2001,2043,2044,2054', '6', '0', '1', 'trade', '烧结多孔砖是指以粘土、页岩、煤矸石为主要原料，经焙烧而成的主要用于承重部位的多孔砖。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2055', '烧结空心砖', '1080105011100000000', '2044', '1,2000,2001,2043,2044,2055', '6', '0', '1', 'trade', '烧结空心砖是指以粘土、页岩、煤矸石为主要原料，经焙烧而成的主要用于非承重部位的空心砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2056', '其他混凝土砖', '1080105011200000000', '2044', '1,2000,2001,2043,2044,2056', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2057', '其他砖', '1080105019900000000', '2044', '1,2000,2001,2043,2044,2057', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2058', '瓦', '1080105020000000000', '2043', '1,2000,2001,2043,2058', '5', '0', '1', 'trade', '以粘土、页岩和煤矸石、粉煤灰等工业废弃物为原料，通过焙烧或蒸压方法制成的建筑用瓦', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2059', '建筑砌块', '1080105030000000000', '2043', '1,2000,2001,2043,2059', '5', '0', '1', 'trade', '用于砌筑墙体的砌块，尺寸大于砖，包括建筑墙体用混凝土砌块、水工市政用混凝土砌块、蒸压硅酸盐制品块材、石膏砌块等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2060', '普通混凝土小型空心砌块', '1080105030100000000', '2059', '1,2000,2001,2043,2059,2060', '6', '0', '1', 'trade', '用水泥作胶结材料，砂、石作集料，经搅拌、振动（或压制）成型、养护等工艺过程制成', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2061', '轻集料混凝土小型空心砌块', '1080105030200000000', '2059', '1,2000,2001,2043,2059,2061', '6', '0', '1', 'trade', '以水泥为胶结料，以各种轻集料为填充材料，经计量、搅拌、成型、养护等工艺制成的新型墙体材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2062', '烧结保温砖（砌块）', '1080105030300000000', '2059', '1,2000,2001,2043,2059,2062', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2063', '蒸压加气混凝土砌块', '1080105030400000000', '2059', '1,2000,2001,2043,2059,2063', '6', '0', '1', 'trade', '指以水泥、石灰、砂或粉煤灰等胶凝材料为主要原材料，经计量、搅拌、发泡、切割、蒸压养护等工艺制成的一种多孔新型墙体材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2064', '石膏砌块', '1080105030500000000', '2059', '1,2000,2001,2043,2059,2064', '6', '0', '1', 'trade', '以石膏为主要原料，经加水搅拌、浇注成型和干燥等制成的轻质石膏制品，包括脱硫石膏。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2065', '粉煤灰混凝土小型空心砌块', '1080105030600000000', '2059', '1,2000,2001,2043,2059,2065', '6', '0', '1', 'trade', '以粉煤灰、水泥、各种轻重集料、水为主要组分拌合制成的小型空心砌块', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2066', '复合保温砖（砌块）', '1080105030700000000', '2059', '1,2000,2001,2043,2059,2066', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2067', '蒸压泡沫混凝土砌块', '1080105030800000000', '2059', '1,2000,2001,2043,2059,2067', '6', '0', '1', 'trade', '指将化学发泡剂或物理发泡剂发泡后加入到胶凝材料、掺合料、改性剂、卤水等制成的料浆中，经混合搅拌、浇注成型、自然养护所形成的一种含有大量封闭气孔的新型轻质保温材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2068', '其他建筑砌块', '1080105039900000000', '2059', '1,2000,2001,2043,2059,2068', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2069', '建筑陶瓷制品', '1080106000000000000', '2001', '1,2000,2001,2069', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2070', '陶瓷砖', '1080106010000000000', '2069', '1,2000,2001,2069,2070', '5', '0', '1', 'trade', '包括瓷质砖、炻瓷砖、细炻砖、炻质砖、陶质砖、陶瓷耐酸砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2071', '陶瓷马赛克', '1080106020000000000', '2069', '1,2000,2001,2069,2071', '5', '0', '1', 'trade', '包括无釉陶瓷锦砖、有釉陶瓷锦砖、纳米抗菌陶瓷锦砖、微晶玻璃陶瓷复合砖', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2072', '建筑陶瓷装饰物', '1080106030000000000', '2069', '1,2000,2001,2069,2072', '5', '0', '1', 'trade', '房屋、墙壁、大门等上用的建筑陶瓷装饰物', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2073', '其他建筑陶瓷制品', '1080106990000000000', '2069', '1,2000,2001,2069,2073', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2074', '石材、石料加工品及制品', '1080107000000000000', '2001', '1,2000,2001,2074', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2075', '加工天然石材、石料', '1080107010000000000', '2074', '1,2000,2001,2074,2075', '5', '0', '1', 'trade', '指除经劈、锯、粗切成块、片、板状（石面为方形或长方形）以外，还须经过进一步加工的石料、石块、石板或石片', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2076', '人造石材、石料', '1080107020000000000', '2074', '1,2000,2001,2074,2076', '5', '0', '1', 'trade', '以不饱和聚酯树脂为粘结剂，配以天然大理石或方解石、白云石、硅砂、玻璃粉等无机物粉料，以及适量的阻燃剂、颜料等，经配料混合、瓷铸、振动压缩、挤压等方法成型固化制成', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2077', '天然石材制成品', '1080107030000000000', '2074', '1,2000,2001,2074,2077', '5', '0', '1', 'trade', '包括经加工的石砖、瓦、方块及类似品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2078', '人造石材制成品', '1080107040000000000', '2074', '1,2000,2001,2074,2078', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2079', '水磨石建筑制成品', '1080107050000000000', '2074', '1,2000,2001,2074,2079', '5', '0', '1', 'trade', '以水泥、石渣和砂为主要原材料，经搅拌、振动或压制成型、养护、研磨等工序制作而成的建筑水磨石板材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2080', 'PVC石英砂地板砖', '1080107060000000000', '2074', '1,2000,2001,2074,2080', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2081', '其他石制品', '1080107990000000000', '2074', '1,2000,2001,2074,2081', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2082', '建筑防水卷材及制品', '1080108000000000000', '2001', '1,2000,2001,2082', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2083', '沥青和改性沥青防水卷材', '1080108010000000000', '2082', '1,2000,2001,2082,2083', '5', '0', '1', 'trade', '包括石油沥青防水卷材、改性沥青防水卷材、其他沥青防水卷材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2084', '自粘防水卷材', '1080108020000000000', '2082', '1,2000,2001,2082,2084', '5', '0', '1', 'trade', '包括自粘橡胶沥青防水卷材、自粘聚合物改性沥青聚酯胎防水卷材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2085', '玻纤胎沥青瓦', '1080108030000000000', '2082', '1,2000,2001,2082,2085', '5', '0', '1', 'trade', '以石油沥青为主要原料，加入矿物填料，采用玻纤毡为胎基、上表面覆以保护材料，用于铺设搭接法施工的坡屋面的沥青瓦', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2086', '高分子防水卷（片）材', '1080108040000000000', '2082', '1,2000,2001,2082,2086', '5', '0', '1', 'trade', '包括橡胶防水卷（片）材、合成树脂类防水卷（片）材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2087', '其他建筑防水卷材及制品', '1080108990000000000', '2082', '1,2000,2001,2082,2087', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2088', '隔热、隔音人造矿物材料及其制品', '1080109000000000000', '2001', '1,2000,2001,2088', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2089', '矿物绝热和吸声材料', '1080109010000000000', '2088', '1,2000,2001,2088,2089', '5', '0', '1', 'trade', '包括矿物棉、膨胀矿物材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2090', '矿物材料制品', '1080109020000000000', '2088', '1,2000,2001,2088,2090', '5', '0', '1', 'trade', '主要起绝热、吸声作用', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2091', '玻璃', '1080110000000000000', '2001', '1,2000,2001,2091', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2092', '平板玻璃', '1080110010000000000', '2091', '1,2000,2001,2091,2092', '5', '0', '1', 'trade', '指板状硅酸盐玻璃，主要用于建筑业、车船业、电子工业、太阳能工业、制镜业、现代农业等部门，是重要的建筑材料和工业技术玻璃的基础材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2093', '特种玻璃', '1080110020000000000', '2091', '1,2000,2001,2091,2093', '5', '0', '1', 'trade', '包括石英玻璃制品、石英玻璃、光栅玻璃、微晶玻璃、U型玻璃、电子工业用超薄玻璃、太阳能工业用超白玻璃', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2094', '微晶玻璃', '1080110020100000000', '2093', '1,2000,2001,2091,2093,2094', '6', '0', '1', 'trade', '由适当组成的玻璃颗粒经烧结和晶化，制成由结晶相和玻璃相组成的质地坚实、致密均匀的复相材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2095', 'U型玻璃', '1080110020200000000', '2093', '1,2000,2001,2091,2093,2095', '6', '0', '1', 'trade', '是用先压延后成型的方法连续生产出来的，横截面呈\"U\"型的玻璃，适用于建筑的内外墙、隔墙、屋面及窗等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2096', '其他特种玻璃', '1080110029900000000', '2093', '1,2000,2001,2091,2093,2096', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2097', '玻璃陶瓷型材', '1080110030000000000', '2091', '1,2000,2001,2091,2097', '5', '0', '1', 'trade', '指将回收的各种有色或无色透明平板、瓶罐废玻璃与废陶瓷筛选后加工而成的新型装饰材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2098', '玻璃熟料', '1080110040000000000', '2091', '1,2000,2001,2091,2098', '5', '0', '1', 'trade', '对成份差别大的碎玻璃统一加工制成的一种硅质原料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2099', '玻璃制光学元件', '1080111000000000000', '2001', '1,2000,2001,2099', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2100', '光学元件毛坯', '1080111010000000000', '2099', '1,2000,2001,2099,2100', '5', '0', '1', 'trade', '指光学仪器用未经光学加工的光学元件毛坯', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2101', '眼镜用光学玻璃坯件', '1080111020000000000', '2099', '1,2000,2001,2099,2101', '5', '0', '1', 'trade', '包括视力矫正眼镜用玻璃、平光变色镜片坯件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2102', '光学仪器用玻璃', '1080111030000000000', '2099', '1,2000,2001,2099,2102', '5', '0', '1', 'trade', '使用于光学仪器上的玻璃', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2103', '其他玻璃制光学元件', '1080111990000000000', '2099', '1,2000,2001,2099,2103', '5', '0', '1', 'trade', '指在制作中虽未经光学加工，但能产生某种所需的光学效果的元件，包括交通路灯、某种浮标灯、聚光灯泡、小手电、手电筒、配电盘灯或仪表板灯等的透镜及类似品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2104', '玻璃仪器及实验、医疗用玻璃器皿', '1080112000000000000', '2001', '1,2000,2001,2104', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2105', '玻璃计、量器', '1080112010000000000', '2104', '1,2000,2001,2104,2105', '5', '0', '1', 'trade', '指除石英玻璃制仪器和器皿（详见108011202）以外的计量用玻璃器具、仪器', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2106', '石英玻璃制仪器和器皿', '1080112020000000000', '2104', '1,2000,2001,2104,2106', '5', '0', '1', 'trade', '指二氧化硅含量应≥95%的玻璃仪器和器皿，包括熔融石英或其他熔融硅石制实验室、卫生及配药用的玻璃器皿', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2107', '耐热玻璃制仪器和器皿', '1080112030000000000', '2104', '1,2000,2001,2104,2107', '5', '0', '1', 'trade', '指温度在0℃～300℃时，线膨胀系数不超过5*10-6/K的实验室、卫生及配药用玻璃仪器和器皿，但不包括石英玻璃制仪器和器皿（详见108011202）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2108', '其他玻璃仪器及实验、医疗用玻璃器皿', '1080112990000000000', '2104', '1,2000,2001,2104,2108', '5', '0', '1', 'trade', '包括实验室、医疗及配药用的玻璃制专用真空器皿、干燥器、容量瓶、培养皿、显微镜载片和盖片，玻璃制喷射嘴、漏斗、磨砂接头，玻璃制盛尿器、便盆、便壶，玻璃制吸杯、洗眼杯、吸入器、吸管、试管等仪器和器皿', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2109', '玻璃包装容器', '1080113000000000000', '2001', '1,2000,2001,2109', '4', '0', '1', 'trade', '包括日用玻璃瓶（玻璃饮料瓶、玻璃食品瓶、玻璃啤酒瓶、玻璃白酒容器）、药用瓶（医药试剂用广口瓶、输液瓶、安瓿瓶、黄圆瓶、无色小药瓶、抗生素瓶、口服液瓶、农药用瓶）、其他玻璃瓶', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2110', '日用玻璃制品', '1080114000000000000', '2001', '1,2000,2001,2110', '4', '0', '1', 'trade', '指供餐桌、厨房、盥洗室、办公室、室内装饰等用途的玻璃制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2111', '餐饮用玻璃器皿', '1080114010000000000', '2110', '1,2000,2001,2110,2111', '5', '0', '1', 'trade', '包括餐饮用玻璃杯和餐饮用其他玻璃器皿，不包括非餐饮用的其他玻璃器皿或器具（如盥洗用玻璃器具（详见108011402）、办公室及室内装饰用玻璃器具（详见108011403）等）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2112', '盥洗用玻璃器具', '1080114020000000000', '2110', '1,2000,2001,2110,2112', '5', '0', '1', 'trade', '包括玻璃洗手盆，不包括餐饮用玻璃器皿（详见108011401）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2113', '室内及室内装饰用玻璃器具', '1080114030000000000', '2110', '1,2000,2001,2110,2113', '5', '0', '1', 'trade', '包括玻璃制镇纸、墨水台和墨水池、书档、装大头针的容器、笔架、烟灰缸、玻璃花瓶、装饰性水果盘、小塑像、小精品（动物、花、叶、果等）、玻璃艺术品、水晶玻璃制品、琉璃制品、衣饰配件、水钻等装饰玻璃制品，桌面中心、养鱼缸、香炉等以及玻璃风景画、玻璃纪念品等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2114', '其他日用玻璃制品', '1080114990000000000', '2110', '1,2000,2001,2110,2114', '5', '0', '1', 'trade', '不包括钟表（详见1090618）、灯泡（详见1090423）、仪器仪表（详见10906）等产品的玻璃制零配件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2115', '玻璃保温容器及其玻璃胆', '1080115000000000000', '2001', '1,2000,2001,2115', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2116', '玻璃保温容器', '1080115010000000000', '2115', '1,2000,2001,2115,2116', '5', '0', '1', 'trade', '指带壳、带胆的成品保温容器；不包括保温容器用的瓶胆（详见108011502）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2117', '玻璃保温瓶胆', '1080115020000000000', '2115', '1,2000,2001,2115,2117', '5', '0', '1', 'trade', '指玻璃保温容器用的，不带壳的玻璃瓶胆；不包括带壳、带胆的玻璃保温容器成品（详见108011501）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2118', '玻璃纤维及其制品', '1080116000000000000', '2001', '1,2000,2001,2118', '4', '0', '1', 'trade', '包括玻璃纤维纱、短切玻璃纤维、玻璃纤维布、玻璃纤维毡、玻璃纤维土工格栅、玻璃纤维带、玻璃纤维套管等。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2119', '玻璃制绝缘子', '1080117000000000000', '2001', '1,2000,2001,2119', '4', '0', '1', 'trade', '包括导引式绝缘子、刚性绝缘子、其他玻璃制绝缘子', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2120', '未封口玻璃外壳', '1080118000000000000', '2001', '1,2000,2001,2120', '4', '0', '1', 'trade', '指制灯泡、阴极射线管及类似品用的未封口玻璃外壳（包括玻璃泡及管）及其玻璃零件，但未装有配件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2121', '工业品用其他玻璃部件', '1080119000000000000', '2001', '1,2000,2001,2121', '4', '0', '1', 'trade', '包括工业用玻璃制品、玻璃制工业品零配件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2122', '技术陶瓷制品', '1080120000000000000', '2001', '1,2000,2001,2122', '4', '0', '1', 'trade', '技术陶瓷制品也称特种陶瓷，包括结构陶瓷、功能陶瓷、生物陶瓷等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2123', '结构陶瓷制品', '1080120010000000000', '2122', '1,2000,2001,2122,2123', '5', '0', '1', 'trade', '包括实验室用陶瓷制品、陶瓷阀及类似品、陶瓷轴承、陶瓷辊棒、陶瓷制发动机零部件、陶瓷蒸馏器、陶瓷旋管及类似管、陶瓷研磨器和研磨球、陶瓷模头、纺织用陶瓷件耐磨陶瓷件、可控硅瓷环、瓷管、陶瓷刀具、刃具、陶瓷密封件、陶瓷金属化瓷件、其他结构陶瓷制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2124', '功能陶瓷制品', '1080120020000000000', '2122', '1,2000,2001,2122,2124', '5', '0', '1', 'trade', '指具有电、光、磁、声、热、弹性及部分化学功能的陶瓷制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2125', '生物陶瓷制品', '1080120030000000000', '2122', '1,2000,2001,2122,2125', '5', '0', '1', 'trade', '主要指医疗专用的生物陶瓷制品（如生物陶瓷制假牙、关节、骨骼等人工器官）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2126', '陶瓷管及管子配件', '1080120040000000000', '2122', '1,2000,2001,2122,2126', '5', '0', '1', 'trade', '包括陶瓷套管、导管、槽管及管子配件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2127', '瓷绝缘子', '1080120050000000000', '2122', '1,2000,2001,2122,2127', '5', '0', '1', 'trade', '由电工陶瓷制成的绝缘子', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2128', '耐火陶瓷制品', '1080120060000000000', '2122', '1,2000,2001,2122,2128', '5', '0', '1', 'trade', '包括耐火陶瓷管、耐火陶瓷坩埚、硅质耐火陶瓷制品、其他耐火陶瓷制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2129', '其他技术陶瓷制品', '1080120990000000000', '2122', '1,2000,2001,2122,2129', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2130', '日用陶瓷制品', '1080121000000000000', '2001', '1,2000,2001,2130', '4', '0', '1', 'trade', '包括日用陶瓷餐具、厨房用陶瓷器具、盥洗用陶瓷器具、卫生陶瓷制品、园林艺术陶瓷制品和其他日用陶瓷制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2131', '日用陶瓷餐具', '1080121010000000000', '2130', '1,2000,2001,2130,2131', '5', '0', '1', 'trade', '包括日用瓷质餐具、陶质餐具、炻质餐具，如陶瓷茶具或咖啡用具，陶瓷盘、碗、碟、杯、汤匙、家用电热壶等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2132', '厨房用陶瓷器具', '1080121020000000000', '2130', '1,2000,2001,2130,2132', '5', '0', '1', 'trade', '包括瓷质厨房用器具、陶质厨房用器具、炻质厨房用器具，如陶瓷烘烤盘、盆、壶、罐、坛等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2133', '盥洗用陶瓷器具', '1080121030000000000', '2130', '1,2000,2001,2130,2133', '5', '0', '1', 'trade', '包括瓷质盥洗用器具、陶质盥洗用器具、炻质盥洗用器具，如陶瓷卫生桶、便盆、尿壶、便壶、痰孟、肥皂碟、毛巾架等，以及类似的盥洗用陶瓷器具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2134', '卫生陶瓷制品', '1080121040000000000', '2130', '1,2000,2001,2130,2134', '5', '0', '1', 'trade', '又称卫生洁具，由粘土或其他无机物质经混练、成型、高温烧制而成的用做卫生设施的有釉陶瓷制品，包括各种不同型号的大便器、小便器、洗面器、妇女洗涤器、高低水箱、洗涤槽、返水管、浴盆等；包括陶瓷、仿瓷、玻璃陶瓷、玻璃纤维增强塑料制卫生设备', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2135', '园林艺术陶瓷制品', '1080121050000000000', '2130', '1,2000,2001,2130,2135', '5', '0', '1', 'trade', '包括瓷质或陶质的果皮箱、花盆等，不包括陶瓷制园林桌、椅、凳（详见105020108）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2136', '其他日用陶瓷制品', '1080121990000000000', '2130', '1,2000,2001,2130,2136', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2137', '运输及盛装货物用陶瓷容器', '1080122000000000000', '2001', '1,2000,2001,2137', '4', '0', '1', 'trade', '包括耐酸陶瓷容器、食品用陶瓷容器、药品或化妆品陶瓷容器和其他运输及盛装货物用陶瓷容器。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2138', '耐酸陶瓷容器', '1080122010000000000', '2137', '1,2000,2001,2137,2138', '5', '0', '1', 'trade', '指耐酸性侵蚀的陶瓷容器。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2139', '食品用陶瓷容器', '1080122020000000000', '2137', '1,2000,2001,2137,2139', '5', '0', '1', 'trade', '指用于盛装食品陶瓷瓶、坛、罐；包括果酱、调味品、肉酱、利口酒等用的陶瓷容器', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2140', '药品或化妆品陶瓷容器', '1080122030000000000', '2137', '1,2000,2001,2137,2140', '5', '0', '1', 'trade', '包括药品、化妆品及墨水等的陶瓷瓶、坛、罐', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2141', '其他运输及盛装货物用陶瓷容器', '1080122990000000000', '2137', '1,2000,2001,2137,2141', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2142', '其他陶瓷制品', '1080123000000000000', '2001', '1,2000,2001,2142', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2143', '石棉纤维及其制品', '1080124000000000000', '2001', '1,2000,2001,2143', '4', '0', '1', 'trade', '包括已加工石棉纤维、石棉制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2144', '已加工石棉纤维', '1080124010000000000', '2143', '1,2000,2001,2143,2144', '5', '0', '1', 'trade', '包括已加工石棉纤维，石棉为主的混合物及其制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2145', '石棉制品', '1080124020000000000', '2143', '1,2000,2001,2143,2145', '5', '0', '1', 'trade', '包括石棉纱、线及其纺织制品、石棉隔热保温制品、石棉密封垫板、无石棉密封垫板、石棉密封垫片、垫圈、特种石棉制品、石棉摩擦材料、无石棉摩擦材料和其他石棉制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2146', '已加工云母及其制品', '1080125000000000000', '2001', '1,2000,2001,2146', '4', '0', '1', 'trade', '包括除劈分和整理外还经过进一步加工（如切割成形）的天然云母，也包括由粘聚（粘合）云母或纸浆（再造）云母制成的产品，以及上述任何材料的制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2147', '已加工云母', '1080125010000000000', '2146', '1,2000,2001,2146,2147', '5', '0', '1', 'trade', '包括厚片云母、薄片云母、云母粉。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2148', '云母制品', '1080125020000000000', '2146', '1,2000,2001,2146,2148', '5', '0', '1', 'trade', '包括云母板、云母片、云母箔、云母带、模制云母制品、云母碎屑制品、云母纸制品和其他云母制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2149', '耐火材料制品', '1080126000000000000', '2001', '1,2000,2001,2149', '4', '0', '1', 'trade', '包括致密定形耐火制品、隔热耐火制品、不定形耐火制品和其他耐火材料制品，不包括耐火陶瓷制品（详见108012006）。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2150', '石墨及炭素制品', '1080127000000000000', '2001', '1,2000,2001,2150', '4', '0', '1', 'trade', '以石油焦、天然石墨、煤沥青等富含炭元素的基材为主要原料，经特定工艺处理的人工制成品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2151', '石墨制品', '1080127010000000000', '2150', '1,2000,2001,2150,2151', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2152', '石墨电极', '1080127010100000000', '2151', '1,2000,2001,2150,2151,2152', '6', '0', '1', 'trade', '以优质石油焦为主要原料，煤沥青作粘结剂，经特定工艺加工而制成，是在电弧炉中以电弧形式释放热能对炉料进行加热溶化的导体，包括普通功率石墨电极、高功率石墨电极、超高功率石墨电极。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2153', '石墨阳极', '1080127010200000000', '2151', '1,2000,2001,2150,2151,2153', '6', '0', '1', 'trade', '以石油焦为主要原料，煤沥青作粘结剂，经特定工艺加工而成，主要用于电化学工业中电解设备的导电阳极。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2154', '其他石墨制品', '1080127010300000000', '2151', '1,2000,2001,2150,2151,2154', '6', '0', '1', 'trade', '指除石墨电极（详见10801270101）、石墨阳极（详见10801270102）以外的其他石墨制品，包括石墨块、石墨粉、石墨异型件。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2155', '炭制品', '1080127020000000000', '2150', '1,2000,2001,2150,2155', '5', '0', '1', 'trade', '以无烟煤、冶金焦为主要原料，煤沥青作粘结剂，经特定工艺加工制作而成，主要用作高炉内衬、铝电解槽和其他电炉的炉衬材料和导电材料，包括炭块、炭电极、炭湖和其他炭制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2156', '炭素新材料', '1080127030000000000', '2150', '1,2000,2001,2150,2156', '5', '0', '1', 'trade', '包括特种石墨制品、热解石墨制品、炭素纤维类及制品和其他炭素新材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2157', '其他炭素产品', '1080127990000000000', '2150', '1,2000,2001,2150,2157', '5', '0', '1', 'trade', '包括石墨热交换器、柔性石墨制品、电炭产品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2158', '磨具', '1080128000000000000', '2001', '1,2000,2001,2158', '4', '0', '1', 'trade', '指用于磨削、研磨和抛光的工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2159', '固结磨具', '1080128010000000000', '2158', '1,2000,2001,2158,2159', '5', '0', '1', 'trade', '包括碾磨或磨浆用石磨、石碾、机用磨石、抛光石、砂轮、磨头、磨盘、磨齿、手用磨石。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2160', '天然石制磨具', '1080128020000000000', '2158', '1,2000,2001,2158,2160', '5', '0', '1', 'trade', '包括碾磨或磨浆用石磨、石碾及其零件；刀具、工具等磨刃用的磨石；磨刀石、油石及类似品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2161', '涂附磨具', '1080128030000000000', '2158', '1,2000,2001,2158,2161', '5', '0', '1', 'trade', '包括布基、纸基、涂附磨具异型产品和其他涂附磨具。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2162', '超硬材料制品', '1080128040000000000', '2158', '1,2000,2001,2158,2162', '5', '0', '1', 'trade', '指用金刚石或立方氮化硼制成的磨削、切削、锯切、钻探、拉丝等各类工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2163', '磨料', '1080129000000000000', '2001', '1,2000,2001,2163', '4', '0', '1', 'trade', '包括天然研磨料、普通磨料、超硬材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2164', '天然研磨料', '1080129010000000000', '2163', '1,2000,2001,2163,2164', '5', '0', '1', 'trade', '包括刚玉砂、石榴石、浮石、燧石、石英砂等天然矿物粉及玻璃粉', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2165', '普通磨料', '1080129020000000000', '2163', '1,2000,2001,2163,2165', '5', '0', '1', 'trade', '包括人造刚玉、碳化硅磨料、碳化硼磨料(包括碳化硼碎块、颗粒、微粉)。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2166', '超硬材料', '1080129030000000000', '2163', '1,2000,2001,2163,2166', '5', '0', '1', 'trade', '包括人造金刚石、立方氮化硼的单晶、多晶、微粉、纳米粉及其聚晶，化学气相沉积（CVD）金刚石', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2167', '沥青、泥炭', '1080130000000000000', '2001', '1,2000,2001,2167', '4', '0', '1', 'trade', '包括沥青混合物、泥炭制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2168', '沥青混合物', '1080130010000000000', '2167', '1,2000,2001,2167,2168', '5', '0', '1', 'trade', '指以天然沥青、石油沥青、矿物焦油等为基本成分的沥青混合物', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2169', '泥炭制品', '1080130020000000000', '2167', '1,2000,2001,2167,2169', '5', '0', '1', 'trade', '包括泥炭制片、泥炭制气缸壳体、植物培植盆和其他泥炭制品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2170', '其他非金属矿物制品', '1080199000000000000', '2001', '1,2000,2001,2170', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2171', '以废渣生产非金属矿物制品', '1080199010000000000', '2170', '1,2000,2001,2170,2171', '5', '0', '1', 'trade', '以废渣为原料生产墙板【不包括轻质隔墙条板（详见108010403）】、管材（管桩）【不包括预应力混凝土管桩（详见108010306）】、陶粒、砂浆、道路井盖、道路护栏、防火材料、保温材料、矿（岩）棉', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2172', '黑色金属冶炼及压延产品', '1080200000000000000', '2000', '1,2000,2172', '3', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2173', '生铁', '1080201000000000000', '2172', '1,2000,2172,2173', '4', '0', '1', 'trade', '高炉冶炼的合格生铁，包括炼钢生铁、铸造生铁、含钒生铁', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2174', '还原铁', '1080202000000000000', '2172', '1,2000,2172,2174', '4', '0', '1', 'trade', '包括直接还原铁、熔融还原铁', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2175', '球墨铸铁', '1080203000000000000', '2172', '1,2000,2172,2175', '4', '0', '1', 'trade', '包括高炉生铁产球墨铸铁及其他生铁产球墨铸铁', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2176', '铸铁管及其附件', '1080204000000000000', '2172', '1,2000,2172,2176', '4', '0', '1', 'trade', '包括铸铁管、铸铁直管、铸铁空心异型管、铸铁管附件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2177', '铸铁管', '1080204010000000000', '2176', '1,2000,2172,2176,2177', '5', '0', '1', 'trade', '指用铸铁浇铸成型的管子', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2178', '铸铁直管', '1080204020000000000', '2176', '1,2000,2172,2176,2178', '5', '0', '1', 'trade', '包括连续式生产铸铁直管、离心式生产铸铁直管、其他方式生产铸铁直管、灰铁铸铁管、球墨铸铁管、其他铸铁管、大口径铸铁直管、中口径铸铁直管、小口径铸铁直管', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2179', '铸铁空心异型管', '1080204030000000000', '2176', '1,2000,2172,2176,2179', '5', '0', '1', 'trade', '指用铸铁浇铸成异型的空心管', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2180', '铸铁管附件', '1080204040000000000', '2176', '1,2000,2172,2176,2180', '5', '0', '1', 'trade', '包括无可锻性铸铁管子附件、可锻性铸铁及铸钢管子附件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2181', '粗钢', '1080205000000000000', '2172', '1,2000,2172,2181', '4', '0', '1', 'trade', '指完成了冶炼过程、未经塑性加工的钢，其形态为液态或铸态固体，包括非合金钢粗钢、低合金钢粗钢、合金钢粗钢、不锈钢粗钢；方坯（粗钢）、矩形坯（粗钢）、板坯（粗钢）、圆坯（粗钢）、异形坯（粗钢）、管坯（粗钢）；模铸钢锭；铸造用液态钢；镇静钢、沸腾钢、半镇静钢；转炉钢、电弧炉钢、感应电炉钢', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2182', '轧制、锻造钢坯', '1080206000000000000', '2172', '1,2000,2172,2182', '4', '0', '1', 'trade', '包括非合金钢钢坯、合金钢钢坯、低合金钢钢坯、不锈钢钢坯；轧制坯、锻造坯；方坯（钢坯）、矩形坯（钢坯）、板坯（钢坯）、圆坯（钢坯）、异形坯（钢坯）、管坯（钢坯）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2183', '钢材', '1080207000000000000', '2172', '1,2000,2172,2183', '4', '0', '1', 'trade', '包括铁道用钢材、大型型钢、中小型型钢、棒材、钢筋、线材（盘条）、钢板、热轧薄板、冷轧薄板、钢带、板带、无缝钢管、焊接钢管、其他钢材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2184', '铁道用钢材', '1080207010000000000', '2183', '1,2000,2172,2183,2184', '5', '0', '1', 'trade', '指铁道及电车道铺轨用钢铁材料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2185', '大型型钢', '1080207020000000000', '2183', '1,2000,2172,2183,2185', '5', '0', '1', 'trade', '产品的横截面如字母Ｉ、Ｕ、Ｌ、Ｚ、Ｔ等形状，其高度≥80mm（包括氧气瓶料）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2186', '中小型型钢', '1080207030000000000', '2183', '1,2000,2172,2183,2186', '5', '0', '1', 'trade', '产品的横截面如字母Ｉ、Ｕ、Ｌ、Ｚ、Ｔ等形状，其高度＜80mm', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2187', '棒材', '1080207040000000000', '2183', '1,2000,2172,2183,2187', '5', '0', '1', 'trade', '横截面为圆形、方形、六角形、八角形、扁形等简单断面并以直条交货的钢材，不包括混凝土用钢筋（详见108020705）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2188', '钢筋', '1080207050000000000', '2183', '1,2000,2172,2183,2188', '5', '0', '1', 'trade', '钢筋混凝土和预应力钢筋混凝土用的轧制产品，横截面通常为圆形或带有圆角的方形，包括光圆钢筋、带肋钢筋、扭转钢筋等；可以直条交货，也可以盘状交货；不包括线材轧机生产的产品（详见108020705）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2189', '线材（盘条）', '1080207060000000000', '2183', '1,2000,2172,2183,2189', '5', '0', '1', 'trade', '经线材轧机热轧后卷成盘状交货的产品，其横截面通常为圆形、椭圆形、方形、矩形、六角形、八角形或其他形状包括调出及企业自用于拔制钢丝的盘条', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2190', '钢板', '1080207070000000000', '2183', '1,2000,2172,2183,2190', '5', '0', '1', 'trade', '包括厚钢板和中板', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2191', '热轧薄板', '1080207080000000000', '2183', '1,2000,2172,2183,2191', '5', '0', '1', 'trade', '包括非合金钢热轧薄板、低合金钢热轧薄板、合金钢热轧薄板、不锈钢热轧薄板等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2192', '冷轧薄板', '1080207090000000000', '2183', '1,2000,2172,2183,2192', '5', '0', '1', 'trade', '包括非合金钢冷轧薄板、低合金钢冷轧薄板、合金钢冷轧薄板、不锈钢冷轧薄板等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2193', '钢带', '1080207100000000000', '2183', '1,2000,2172,2183,2193', '5', '0', '1', 'trade', '包括中厚宽钢带、热轧钢带、冷轧钢带', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2194', '板带', '1080207110000000000', '2183', '1,2000,2172,2183,2194', '5', '0', '1', 'trade', '包括镀层板带、涂层板带、电工钢板带等所有板带', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2195', '无缝钢管', '1080207120000000000', '2183', '1,2000,2172,2183,2195', '5', '0', '1', 'trade', '指具有中空截面，大量用作输送流体的管道，如输送石油、天然气、煤气、水及某些固体物料的管道等，不包括铸铁管（详见108020712）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2196', '焊接钢管', '1080207130000000000', '2183', '1,2000,2172,2183,2196', '5', '0', '1', 'trade', '指用钢带或钢板弯曲变形为圆形、方形等形状后再焊接成的、表面有接缝的钢管', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2197', '其他钢材', '1080207990000000000', '2183', '1,2000,2172,2183,2197', '5', '0', '1', 'trade', '指除铁道用钢材、大型型钢、中小型型钢、棒材、钢筋、线材（盘条）、钢板、热轧薄板、冷轧薄板、钢带、板带、无缝钢管、焊接钢管以外的钢材；如钢铁企业锻钢车间生产的锻钢件（包括锻锤、精锻、快锻以及水压机、挤压机、液压机生产的锻钢件，也包括炼钢炉料，但不包括锻钢件中的型材（详见108020702、108020703）、棒材（详见108020704）和无缝钢管（详见108020712）、冷弯型钢、减振复合钢板等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2198', '铁合金', '1080208000000000000', '2172', '1,2000,2172,2198', '4', '0', '1', 'trade', '指炼钢时作为脱氧剂、元素添加剂等加入铁水中使钢具备某种特性或达到某种要求的一种产品，包括普通铁合金和特种铁合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2199', '废旧物资冶炼、提纯金属及合金', '1080209000000000000', '2172', '1,2000,2172,2199', '4', '0', '1', 'trade', '指利用废旧物资经冶炼、提纯或化合生产的金属、合金及金属化合，不包括铁（详见1080201）及铁合金（详见1080208）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2200', '有色金属冶炼及压延产品', '1080300000000000000', '2000', '1,2000,2200', '3', '0', '1', 'trade', '包括十种有色金属、镉、铋，相关常用有色金属、贵金属、稀有稀土金属、碱金属及碱土金属、有色金属合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2201', '铜', '1080301000000000000', '2200', '1,2000,2200,2201', '4', '0', '1', 'trade', '包括粗铜、阳极铜、精炼铜（电解铜）、直接利用再生铜', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2202', '铅锌', '1080302000000000000', '2200', '1,2000,2200,2202', '4', '0', '1', 'trade', '包括铅和锌', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2203', '铅', '1080302010000000000', '2202', '1,2000,2200,2202,2203', '5', '0', '1', 'trade', '指用铅精矿和铅废料为原料生产的电铅（铅锭，含一号铅至三号铅，含铅≥99%）、铅基合金（含铅≥99%）、铸造锡铅焊料折铅（不含用成品铅作原料铸造的焊锡料和铅基合金）、其他铅（含铅≥99%）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2204', '锌', '1080302020000000000', '2202', '1,2000,2200,2202,2204', '5', '0', '1', 'trade', '指以锌精矿或锌废碎料作原料经粗炼和精炼工艺生产的锌产品（包括电锌、精锌、商品蒸馏锌和锌品）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2205', '镍', '1080303000000000000', '2200', '1,2000,2200,2205', '4', '0', '1', 'trade', '指以镍精矿及镍废碎料等物料为原料，经冶炼生产的镍产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2206', '锡', '1080304000000000000', '2200', '1,2000,2200,2206', '4', '0', '1', 'trade', '指未煅轧锡，包括电锡、精锡、锡基合金折锡、铸造锡铅焊料折锡', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2207', '锑', '1080305000000000000', '2200', '1,2000,2200,2207', '4', '0', '1', 'trade', '包括锑品（矿产）、三氧化二锑、精锑、高铅锑、生锑（硫化锑）、其他未锻轧锑、再生锑', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2208', '铝', '1080306000000000000', '2200', '1,2000,2200,2208', '4', '0', '1', 'trade', '包括氧化铝、原铝、再生铝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2209', '氧化铝', '1080306010000000000', '2208', '1,2000,2200,2208,2209', '5', '0', '1', 'trade', '指将铝矾土原料经过化学处理，除去硅、铁、钛等的氧化物而制得', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2210', '原铝（电解铝）', '1080306020000000000', '2208', '1,2000,2200,2208,2210', '5', '0', '1', 'trade', '指以氧化铝为原料生产的电解铝及直接用铝液生产的铝合金、铝母线、铝板卷及铝导杆等产品。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2211', '再生铝', '1080306030000000000', '2208', '1,2000,2200,2208,2211', '5', '0', '1', 'trade', '指以废旧铝为原料通过废熔炉生产的再生铝，包括再生铝锭、再生铝合金及铝加工、制品企业熔铸使用的再生铝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2212', '镁', '1080307000000000000', '2200', '1,2000,2200,2212', '4', '0', '1', 'trade', '包括原生镁（矿产镁锭）、再生镁、镁环、镁粒（粉）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2213', '钛', '1080308000000000000', '2200', '1,2000,2200,2213', '4', '0', '1', 'trade', '包括钛、海绵钛、高钛渣\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2214', '汞及汞化合物', '1080309000000000000', '2200', '1,2000,2200,2214', '4', '0', '1', 'trade', '包括汞（金属汞）、氧化汞、汞触媒，不包括朱砂（详见107021003）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2215', '镉、铋，相关常用有色金属', '1080310000000000000', '2200', '1,2000,2200,2215', '4', '0', '1', 'trade', '包括镉、铋、钴和相关常用有色金属', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2216', '镉', '1080310010000000000', '2215', '1,2000,2200,2215,2216', '5', '0', '1', 'trade', '指用重有色金属伴生矿作原料经冶炼工艺综合回收的精镉（锭）和镉废碎料作原料生产的精镉（镉锭）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2217', '铋', '1080310020000000000', '2215', '1,2000,2200,2215,2217', '5', '0', '1', 'trade', '包括矿产铋、一号铋、二号铋、其他矿产铋、再生铋', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2218', '钴', '1080310030000000000', '2215', '1,2000,2200,2215,2218', '5', '0', '1', 'trade', '包括氧化钴、金属钴、电解钴、电积钴、钴铁、其他钴盐', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2219', '其他常用有色金属', '1080310990000000000', '2215', '1,2000,2200,2215,2219', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2220', '贵金属', '1080311000000000000', '2200', '1,2000,2200,2220', '4', '0', '1', 'trade', '包括黄金、白银、铂、钯、铑、铱、锇、钌和其他贵金属\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2221', '黄金', '1080311010000000000', '2220', '1,2000,2200,2220,2221', '5', '0', '1', 'trade', '指矿山成品金和冶炼产金（金锭），产品为一号、二号、三号金，含金≥99.9%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2222', '黄金矿砂（含伴生金）', '1080311010100000000', '2221', '1,2000,2200,2220,2221,2222', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2223', '其他黄金', '1080311010200000000', '2221', '1,2000,2200,2220,2221,2223', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2224', '白银（银锭）', '1080311020000000000', '2220', '1,2000,2200,2220,2224', '5', '0', '1', 'trade', '指用银精矿及废杂银（回收的再生银）作原料生产的银（银锭），产品含一号、二号、三号银，银≥99.9%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2225', '铂', '1080311030000000000', '2220', '1,2000,2200,2220,2225', '5', '0', '1', 'trade', '包括金属铂（铂锭）、矿产铂、再生铂、铂粉', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2226', '钯', '1080311040000000000', '2220', '1,2000,2200,2220,2226', '5', '0', '1', 'trade', '包括金属钯、矿产钯、再生钯、钯粉', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2227', '铑', '1080311050000000000', '2220', '1,2000,2200,2220,2227', '5', '0', '1', 'trade', '包括未锻造铑、铑粉。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2228', '铱', '1080311060000000000', '2220', '1,2000,2200,2220,2228', '5', '0', '1', 'trade', '包括未锻造铱、铱粉。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2229', '锇', '1080311070000000000', '2220', '1,2000,2200,2220,2229', '5', '0', '1', 'trade', '包括未锻造锇、锇粉。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2230', '钌', '1080311080000000000', '2220', '1,2000,2200,2220,2230', '5', '0', '1', 'trade', '包括未锻造钌、钌粉。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2231', '其他贵金属', '1080311990000000000', '2220', '1,2000,2200,2220,2231', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2232', '稀有稀土金属', '1080312000000000000', '2200', '1,2000,2200,2232', '4', '0', '1', 'trade', '包括稀有金属、单一稀土金属、其他单一稀土金属、混合稀土金属\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2233', '稀有金属', '1080312010000000000', '2232', '1,2000,2200,2232,2233', '5', '0', '1', 'trade', '包括钨、钼、钽、铌、锆、铍（金属铍）、铊（金属铊）、镓、铪、铟、铼（金属铼）、其他稀有金属\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2234', '钨', '1080312010100000000', '2233', '1,2000,2200,2232,2233,2234', '6', '0', '1', 'trade', '指用钨精矿、仲钨酸铵及氧化钨作原料生产的钨冶炼产品，是钨材及硬质合金原料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2235', '钼', '1080312010200000000', '2233', '1,2000,2200,2232,2233,2235', '6', '0', '1', 'trade', '指用钼精矿、氧化钼及钼酸铵作原料生产的钼冶炼产品，是钼材及硬质合金原料', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2236', '钽', '1080312010300000000', '2233', '1,2000,2200,2232,2233,2236', '6', '0', '1', 'trade', '指用钽铌精矿、钽氧化物及氟钽酸钾等物料作原料经火法或湿法冶炼生产的钽金属', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2237', '铌', '1080312010400000000', '2233', '1,2000,2200,2232,2233,2237', '6', '0', '1', 'trade', '指用钽铌精矿、铌氧化物等物料作原料经火法或湿法冶炼生产的铌金属', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2238', '锆', '1080312010500000000', '2233', '1,2000,2200,2232,2233,2238', '6', '0', '1', 'trade', '指用锆英石等物料为原料经冶炼生产的产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2239', '铍（金属铍）', '1080312010600000000', '2233', '1,2000,2200,2232,2233,2239', '6', '0', '1', 'trade', '指用铍矿石、工业氧化铍及铍废碎料为原料，经电解法和还原法生产的金属铍', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2240', '铊（金属铊）', '1080312010700000000', '2233', '1,2000,2200,2232,2233,2240', '6', '0', '1', 'trade', '指在冶炼铜、铅锌等金属产品时综合回收的铊金属，铊含量一般在四个九以上', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2241', '镓', '1080312010800000000', '2233', '1,2000,2200,2232,2233,2241', '6', '0', '1', 'trade', '指在生产氧化铝过程中从铝土矿中回收金属镓（工业镓），包括原生镓和再生镓，镓含量99.99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2242', '铪', '1080312010900000000', '2233', '1,2000,2200,2232,2233,2242', '6', '0', '1', 'trade', '指铪的冶炼产品，用于核能及军工领域', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2243', '铟', '1080312011000000000', '2233', '1,2000,2200,2232,2233,2243', '6', '0', '1', 'trade', '指属于稀散金属，金属铟主要来自铜、铅、锌及锡等有色金属冶炼过程中富集物的回收，铟分为In99.9%、In99.97%、In99.993%三个品种', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2244', '铼（金属铼）', '1080312011100000000', '2233', '1,2000,2200,2232,2233,2244', '6', '0', '1', 'trade', '指属于稀散金属，原料是与铜、钼、铀等矿伴生，在冶炼铜、钼等金属工程中采用氧化焙烧-沉淀法、石灰烧结法、萃取法、离子交换法、电溶氧化法及高压浸煮法等传统提铼方法提取金属铼', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2245', '其他稀有金属', '1080312019900000000', '2233', '1,2000,2200,2232,2233,2245', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2246', '单一稀土金属', '1080312020000000000', '2232', '1,2000,2200,2232,2246', '5', '0', '1', 'trade', '指采用熔盐电解、金属热还原和火法提纯三种冶炼工艺生产的单一稀土金属产品；单一稀土金属有17种，分为铈组轻金属7种：镧、铈、镨、钕、钷、钐、铕；钇组重金属9种：钆、铽、镝、钬、铒、铥、镱、镥和钇；钪为另类稀土金属。本类均指经冶炼后的单一稀土金属，且该单一稀土金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2247', '金属钕', '1080312020100000000', '2246', '1,2000,2200,2232,2246,2247', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属钕，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2248', '金属镝', '1080312020200000000', '2246', '1,2000,2200,2232,2246,2248', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属镝，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2249', '金属镧', '1080312020300000000', '2246', '1,2000,2200,2232,2246,2249', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属镧，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2250', '金属镨', '1080312020400000000', '2246', '1,2000,2200,2232,2246,2250', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属镨，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2251', '金属钐', '1080312020500000000', '2246', '1,2000,2200,2232,2246,2251', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属钐，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2252', '金属铕', '1080312020600000000', '2246', '1,2000,2200,2232,2246,2252', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属铕，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2253', '金属钆', '1080312020700000000', '2246', '1,2000,2200,2232,2246,2253', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属钆，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2254', '金属铽', '1080312020800000000', '2246', '1,2000,2200,2232,2246,2254', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属铽，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2255', '金属钪', '1080312020900000000', '2246', '1,2000,2200,2232,2246,2255', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属钪，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2256', '金属钇', '1080312021000000000', '2246', '1,2000,2200,2232,2246,2256', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属钇，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2257', '金属钬', '1080312021100000000', '2246', '1,2000,2200,2232,2246,2257', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属钬，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2258', '金属铈', '1080312021200000000', '2246', '1,2000,2200,2232,2246,2258', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属铈，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2259', '金属铒', '1080312021300000000', '2246', '1,2000,2200,2232,2246,2259', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属铒，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2260', '金属铥', '1080312021400000000', '2246', '1,2000,2200,2232,2246,2260', '6', '0', '1', 'trade', '指经冶炼后的单一稀土金属銩，金属含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2261', '金属钷', '1080312021500000000', '2246', '1,2000,2200,2232,2246,2261', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2262', '金属镱', '1080312021600000000', '2246', '1,2000,2200,2232,2246,2262', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2263', '金属镥', '1080312021700000000', '2246', '1,2000,2200,2232,2246,2263', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2264', '其他单一稀土金属', '1080312029900000000', '2246', '1,2000,2200,2232,2246,2264', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2265', '混合稀土金属', '1080312030000000000', '2232', '1,2000,2200,2232,2265', '5', '0', '1', 'trade', '指两种以上稀土金属，稀土金属总含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2266', '金属镨钕', '1080312030100000000', '2265', '1,2000,2200,2232,2265,2266', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2267', '金属镧镨', '1080312030200000000', '2265', '1,2000,2200,2232,2265,2267', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2268', '金属镨镧', '1080312030300000000', '2265', '1,2000,2200,2232,2265,2268', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2269', '金属镧铈镨钕', '1080312030400000000', '2265', '1,2000,2200,2232,2265,2269', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2270', '电池级稀土金属', '1080312030500000000', '2265', '1,2000,2200,2232,2265,2270', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2271', '冶金级稀土金属', '1080312030600000000', '2265', '1,2000,2200,2232,2265,2271', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2272', '其他混合稀土金属', '1080312039900000000', '2265', '1,2000,2200,2232,2265,2272', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2273', '其他稀土金属', '1080312990000000000', '2232', '1,2000,2200,2232,2273', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2274', '碱金属及碱土金属', '1080313000000000000', '2200', '1,2000,2200,2274', '4', '0', '1', 'trade', '包括碱金属以及碱土金属', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2275', '碱金属', '1080313010000000000', '2274', '1,2000,2200,2274,2275', '5', '0', '1', 'trade', '包括钠、锂、钾、铷、铯和其他碱金属\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2276', '钠', '1080313010100000000', '2275', '1,2000,2200,2274,2275,2276', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2277', '锂', '1080313010200000000', '2275', '1,2000,2200,2274,2275,2277', '6', '0', '1', 'trade', '指用电解或真空热还原-蒸馏技术生产的锂金属，锂含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2278', '钾', '1080313010300000000', '2275', '1,2000,2200,2274,2275,2278', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2279', '铷', '1080313010400000000', '2275', '1,2000,2200,2274,2275,2279', '6', '0', '1', 'trade', '指用锂云母、铯榴石及盐湖卤水作原料经冶炼工艺生产的铷金属，铷含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2280', '铯', '1080313010500000000', '2275', '1,2000,2200,2274,2275,2280', '6', '0', '1', 'trade', '指用铯榴石等原料经真空热还原法、热分解法和电解法生产的金属铯，铯含量≥99%', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2281', '其他碱金属', '1080313019900000000', '2275', '1,2000,2200,2274,2275,2281', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2282', '碱土金属', '1080313020000000000', '2274', '1,2000,2200,2274,2282', '5', '0', '1', 'trade', '包括钙、锶、钡和其他碱金属及碱土金属\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2283', '钙', '1080313020100000000', '2282', '1,2000,2200,2274,2282,2283', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2284', '锶', '1080313020200000000', '2282', '1,2000,2200,2274,2282,2284', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2285', '钡', '1080313020300000000', '2282', '1,2000,2200,2274,2282,2285', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2286', '其他碱金属及碱土金属', '1080313990000000000', '2274', '1,2000,2200,2274,2286', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2287', '有色金属合金', '1080314000000000000', '2200', '1,2000,2200,2287', '4', '0', '1', 'trade', '指含有两种以上有色金属铸造的未锻轧产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2288', '常用有色金属合金', '1080314010000000000', '2287', '1,2000,2200,2287,2288', '5', '0', '1', 'trade', '包括铜合金、铅合金、锌合金、镍合金、铝合金、锡合金、镁合金、钛合金、铋合金、镉合金、钴合金以及其他常用有色金属合金\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2289', '铜合金', '1080314010100000000', '2288', '1,2000,2200,2287,2288,2289', '6', '0', '1', 'trade', '指以铜为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的铜合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2290', '铅合金', '1080314010200000000', '2288', '1,2000,2200,2287,2288,2290', '6', '0', '1', 'trade', '指以铅为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的铅合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2291', '锌合金', '1080314010300000000', '2288', '1,2000,2200,2287,2288,2291', '6', '0', '1', 'trade', '指以锌为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的锌合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2292', '镍合金', '1080314010400000000', '2288', '1,2000,2200,2287,2288,2292', '6', '0', '1', 'trade', '指以镍为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的镍合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2293', '铝合金', '1080314010500000000', '2288', '1,2000,2200,2287,2288,2293', '6', '0', '1', 'trade', '指以铝锭（铝液或再生铝）为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的铝合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2294', '锡合金', '1080314010600000000', '2288', '1,2000,2200,2287,2288,2294', '6', '0', '1', 'trade', '指以锡为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的锡合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2295', '镁合金', '1080314010700000000', '2288', '1,2000,2200,2287,2288,2295', '6', '0', '1', 'trade', '指以镁为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的镁合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2296', '钛合金', '1080314010800000000', '2288', '1,2000,2200,2287,2288,2296', '6', '0', '1', 'trade', '指以海绵钛为基体，加入一种或几种其他有色金属元素所铸造的未锻轧的钛合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2297', '铋合金', '1080314010900000000', '2288', '1,2000,2200,2287,2288,2297', '6', '0', '1', 'trade', '指以铋为基体，加入两种以上有色金属元素所铸造的未锻轧的铋合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2298', '镉合金', '1080314011000000000', '2288', '1,2000,2200,2287,2288,2298', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2299', '钴合金', '1080314011100000000', '2288', '1,2000,2200,2287,2288,2299', '6', '0', '1', 'trade', '指以钴为基体，加入一种或几种金属铸造的未锻轧的钴合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2300', '其他常用有色金属合金', '1080314019900000000', '2288', '1,2000,2200,2287,2288,2300', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2301', '硬质合金', '1080314020000000000', '2287', '1,2000,2200,2287,2301', '5', '0', '1', 'trade', '指以碳化钨（WC）粉、复式碳化钨（WC）粉、钴（Co）粉及钛粉等金属为原料，经混合料制备、压制成型和烧结工艺生产的产品称作硬质合金；按用途分为切削刀片硬质合金、矿用硬质合金、耐磨零件硬质合金和钢结硬质合金；按原料分为钨钴硬质合金、钨钴钛硬质合金、钢结硬质合金及其他硬质合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2302', '稀有稀土金属合金', '1080314030000000000', '2287', '1,2000,2200,2287,2302', '5', '0', '1', 'trade', '包括稀有金属合金、稀土金属合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2303', '稀有金属合金', '1080314030100000000', '2302', '1,2000,2200,2287,2302,2303', '6', '0', '1', 'trade', '包括铍铜合金、铍铝合金、铍镁合金、铌铁合金和其他稀有金属合金\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2304', '稀土金属合金', '1080314030200000000', '2302', '1,2000,2200,2287,2302,2304', '6', '0', '1', 'trade', '指由稀土金属作基体，加入一种或几种金属铸造的合金产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2305', '贵金属合金', '1080314040000000000', '2287', '1,2000,2200,2287,2305', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2306', '金合金', '1080314040100000000', '2305', '1,2000,2200,2287,2305,2306', '6', '0', '1', 'trade', '指以金为基体，加入一种或几种金属铸造的合金产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2307', '银合金', '1080314040200000000', '2305', '1,2000,2200,2287,2305,2307', '6', '0', '1', 'trade', '指以银为基体，加入一种或几种金属铸造的银合金产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2308', '铂合金', '1080314040300000000', '2305', '1,2000,2200,2287,2305,2308', '6', '0', '1', 'trade', '指以铂为基体，加入一种或几种金属铸造的铂合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2309', '钯合金', '1080314040400000000', '2305', '1,2000,2200,2287,2305,2309', '6', '0', '1', 'trade', '指以钯为基体，加入一种或几种金属铸造的钯合金', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2310', '铑、铱、锇合金', '1080314040500000000', '2305', '1,2000,2200,2287,2305,2310', '6', '0', '1', 'trade', '包括铑铱合金、铱锇合金、铱钨合金和其他贵金属合金\n', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2311', '其他贵金属合金', '1080314049900000000', '2305', '1,2000,2200,2287,2305,2311', '6', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2312', '铜压延加工材', '1080315000000000000', '2200', '1,2000,2200,2312', '4', '0', '1', 'trade', '包括铜材、铜盘条（电工用铜线坯）、铜粉及片状粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2313', '铜材', '1080315010000000000', '2312', '1,2000,2200,2312,2313', '5', '0', '1', 'trade', '指以铜金属为基体，经熔铸、挤压或轧制加工生产的板材、带材、箔材、棒材、型材、线材、管材等铜材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2314', '铜盘条（电工用铜线坯）', '1080315020000000000', '2312', '1,2000,2200,2312,2314', '5', '0', '1', 'trade', '指沿整个长度方向上具有均一的横截面，以卷状供应的实心中间产品，供进一步加工用，直径一般为6～35mm，铜加工材总计中不含铜盘条', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2315', '铜粉及片状粉末', '1080315030000000000', '2312', '1,2000,2200,2312,2315', '5', '0', '1', 'trade', '包括铜粉、片状铜粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2316', '铝压延加工材', '1080316000000000000', '2200', '1,2000,2200,2316', '4', '0', '1', 'trade', '包括铝材、铝盘条（电工用圆铝杆）、铝粉及片状粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2317', '铝材', '1080316010000000000', '2316', '1,2000,2200,2316,2317', '5', '0', '1', 'trade', '指以铝金属为基体，经熔铸、挤压或轧制加工生产的板材、带材、箔材、棒材、型材、线材、管材及排材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2318', '铝盘条（电工用圆铝杆）', '1080316020000000000', '2316', '1,2000,2200,2316,2318', '5', '0', '1', 'trade', '指供进一步加工用的中间产品，直径一般为9～20mm', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2319', '铝粉及铝片状粉末', '1080316030000000000', '2316', '1,2000,2200,2316,2319', '5', '0', '1', 'trade', '包括铝非片状粉末、铝片状粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2320', '铅压延加工材', '1080317000000000000', '2200', '1,2000,2200,2320', '4', '0', '1', 'trade', '包括铅材、铅粉及片状粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2321', '铅材', '1080317010000000000', '2320', '1,2000,2200,2320,2321', '5', '0', '1', 'trade', '指以铅为基体，加入一种或几种金属经挤压或轧制生产的产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2322', '铅粉及铅片状粉末', '1080317020000000000', '2320', '1,2000,2200,2320,2322', '5', '0', '1', 'trade', '包括铅粉、铅片状粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2323', '锌压延加工材', '1080318000000000000', '2200', '1,2000,2200,2323', '4', '0', '1', 'trade', '包括锌及锌合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2324', '锌材', '1080318010000000000', '2323', '1,2000,2200,2323,2324', '5', '0', '1', 'trade', '指以锌为基体，加入一种或几种金属经挤压或轧制生产的产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2325', '锌末、锌粉及锌片状粉末', '1080318020000000000', '2323', '1,2000,2200,2323,2325', '5', '0', '1', 'trade', '包括锌末、锌粉。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2326', '镍压延加工材', '1080319000000000000', '2200', '1,2000,2200,2326', '4', '0', '1', 'trade', '包括镍及镍合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2327', '镍材', '1080319010000000000', '2326', '1,2000,2200,2326,2327', '5', '0', '1', 'trade', '指以镍为基体，加入一种或几种金属经挤压或轧制生产的产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2328', '镍粉及镍片状粉末', '1080319020000000000', '2326', '1,2000,2200,2326,2328', '5', '0', '1', 'trade', '指非合金镍粉、合金镍粉，包括片状粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2329', '锡压延加工材', '1080320000000000000', '2200', '1,2000,2200,2329', '4', '0', '1', 'trade', '包括锡及锡合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2330', '锡材', '1080320010000000000', '2329', '1,2000,2200,2329,2330', '5', '0', '1', 'trade', '指以锡为基体，加入一种或几种金属经挤压或轧制及其他加工方法生产的产品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2331', '锡粉及锡片状粉末', '1080320020000000000', '2329', '1,2000,2200,2329,2331', '5', '0', '1', 'trade', '指非锡合金锡粉、锡合金锡粉，包括片状粉末。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2332', '镁、钛，相关常用有色金属加工材', '1080321000000000000', '2200', '1,2000,2200,2332', '4', '0', '1', 'trade', '包括镁材、钛材、镉材、锑材、铋材。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2333', '镁材', '1080321010000000000', '2332', '1,2000,2200,2332,2333', '5', '0', '1', 'trade', '指镁棒材、镁型材异型材、镁板材、镁带材、镁箔材、镁丝材、镁管及空心异型材和其他镁材，包括镁金属压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2334', '钛材', '1080321020000000000', '2332', '1,2000,2200,2332,2334', '5', '0', '1', 'trade', '指钛棒材、钛型材及异型材、钛线材、钛板材、钛带、钛箔材、钛管材、钛锻材和其他钛材，包括钛金属压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2335', '镉材', '1080321030000000000', '2332', '1,2000,2200,2332,2335', '5', '0', '1', 'trade', '包括镉板材、镉棒材和其他镉材。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2336', '锑材', '1080321040000000000', '2332', '1,2000,2200,2332,2336', '5', '0', '1', 'trade', '包括锑棒材、锑板材和其他锑材。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2337', '铋材', '1080321050000000000', '2332', '1,2000,2200,2332,2337', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2338', '贵金属压延加工材', '1080322000000000000', '2200', '1,2000,2200,2338', '4', '0', '1', 'trade', '包括金加工材、银材、铂加工材、钯材、铑加工材、铱加工材、锇加工材、钌加工材和其他贵金属压延加工材。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2339', '金加工材', '1080322010000000000', '2338', '1,2000,2200,2338,2339', '5', '0', '1', 'trade', '指金棒材和其他金加工材，包括金及金合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2340', '银材', '1080322020000000000', '2338', '1,2000,2200,2338,2340', '5', '0', '1', 'trade', '指银棒材、银型材、银板材、银片材、银带材和其他银材，包括银及银合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2341', '铂加工材', '1080322030000000000', '2338', '1,2000,2200,2338,2341', '5', '0', '1', 'trade', '指铂板材、铂片材、铂带材、铂条材、铂管材和其他铂加工材，包括铂及铂合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2342', '钯材', '1080322040000000000', '2338', '1,2000,2200,2338,2342', '5', '0', '1', 'trade', '指钯板材、钯片材、钯带材、钯条材、钯管材和其他钯材，包括钯及钯合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2343', '铑加工材', '1080322050000000000', '2338', '1,2000,2200,2338,2343', '5', '0', '1', 'trade', '指铑板材、铑片材、铑带材、铑条材和其他铑加工材，包括铑及铑合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2344', '铱加工材', '1080322060000000000', '2338', '1,2000,2200,2338,2344', '5', '0', '1', 'trade', '指铱板材、铱片材、铱薄带材和其他铱加工材，包括半制成品形状的铱、锇、钌及其他贵金属材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2345', '锇加工材', '1080322070000000000', '2338', '1,2000,2200,2338,2345', '5', '0', '1', 'trade', '指锇板材、锇片材和其他锇加工材包括半制成品形状的铱、锇、钌及其他贵金属材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2346', '钌加工材', '1080322080000000000', '2338', '1,2000,2200,2338,2346', '5', '0', '1', 'trade', '包括钌板材、钌片材、钌带材和其他钌加工材。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2347', '其他贵金属压延加工材', '1080322990000000000', '2338', '1,2000,2200,2338,2347', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2348', '包覆贵金属金属材料', '1080323000000000000', '2200', '1,2000,2200,2348', '4', '0', '1', 'trade', '包括包金金属材料、包银金属材料、包铂金属材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2349', '包金金属材料', '1080323010000000000', '2348', '1,2000,2200,2348,2349', '5', '0', '1', 'trade', '指包金的金属材料用以制首饰（手镯、表链、耳环等）、表壳、雪茄嘴或香烟嘴、打火机、金器、电触头、化学装置等，包括包金棒、杆、包金板、片、包金带、包金型材、包金丝、包金管和其他包金金属材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2350', '包银金属材料', '1080323020000000000', '2348', '1,2000,2200,2348,2350', '5', '0', '1', 'trade', '包括包银棒、杆、包银板、片、包银带、包银型材、包银丝、包银管和其他包银金属材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2351', '包铂金属材料', '1080323030000000000', '2348', '1,2000,2200,2348,2351', '5', '0', '1', 'trade', '指以银、金、及其他金属为底的包铂材料，包括包铂棒、杆、包铂板、片、包铂带、包铂型材、包铂丝、包铂管和其他包铂金属材料。', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2352', '稀有稀土金属压延加工材', '1080324000000000000', '2200', '1,2000,2200,2352', '4', '0', '1', 'trade', '包括钨加工材、钼加工材、钽加工材、锆加工材、铌加工材、镓加工材、铪加工材、铟加工材、铼加工材、钴加工材、铍加工材、铊加工材、锗加工材、钒加工材和其他稀有稀土金属压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2353', '钨加工材', '1080324010000000000', '2352', '1,2000,2200,2352,2353', '5', '0', '1', 'trade', '指钨棒材、钨型材及异型材、钨板材、钨带材、钨箔、片材、钨丝材、钨高比重材、钨坩埚、钨阳极和其他钨加工材，包括钨及钨合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2354', '钼加工材', '1080324020000000000', '2352', '1,2000,2200,2352,2354', '5', '0', '1', 'trade', '指钼棒材、钼板材、钼带材、钼箔材、钼丝材、钼板坯、钼坩埚、钼顶头和其他钼材，包括钼及钼合金压延加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2355', '钽加工材', '1080324030000000000', '2352', '1,2000,2200,2352,2355', '5', '0', '1', 'trade', '指钽棒、钽板材、钽带、钽箔、钽管材、钽丝材和其他钽加工材，包括钽及钽合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2356', '锆加工材', '1080324040000000000', '2352', '1,2000,2200,2352,2356', '5', '0', '1', 'trade', '指锆板材、锆棒材、锆丝材、锆管材和其他锆加工材，包括锆及锆合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2357', '铌加工材', '1080324050000000000', '2352', '1,2000,2200,2352,2357', '5', '0', '1', 'trade', '指铌板材、铌棒材、铌丝材、铌管材和其他铌加工材，包括铌及铌合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2358', '镓加工材', '1080324060000000000', '2352', '1,2000,2200,2352,2358', '5', '0', '1', 'trade', '指镓板材、镓棒材、镓丝材、镓管材和其他镓加工材，包括镓及镓合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2359', '铪加工材', '1080324070000000000', '2352', '1,2000,2200,2352,2359', '5', '0', '1', 'trade', '指铪板材、铪棒材、铪丝材、铪管材和其他铪加工材，包括铪及铪合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2360', '铟加工材', '1080324080000000000', '2352', '1,2000,2200,2352,2360', '5', '0', '1', 'trade', '指铟板材、铟棒材、铟丝材、铟管材和其他铟加工材，包括铟及铟合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2361', '铼加工材', '1080324090000000000', '2352', '1,2000,2200,2352,2361', '5', '0', '1', 'trade', '指铼板材、铼棒材、铼丝材、铼管材和其他铼加工材，包括铼及铼合金加工材', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2362', '钴加工材', '1080324100000000000', '2352', '1,2000,2200,2352,2362', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2363', '铍加工材', '1080324110000000000', '2352', '1,2000,2200,2352,2363', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2364', '铊加工材', '1080324120000000000', '2352', '1,2000,2200,2352,2364', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2365', '锗加工材', '1080324130000000000', '2352', '1,2000,2200,2352,2365', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2366', '钒加工材', '1080324140000000000', '2352', '1,2000,2200,2352,2366', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2367', '其他稀有稀土金属压延加工材', '1080324990000000000', '2352', '1,2000,2200,2352,2367', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2368', '废弃物资冶炼、提纯有色金属及合金', '1080325000000000000', '2200', '1,2000,2200,2368', '4', '0', '1', 'trade', '指以废弃物资为原料，经冶炼、提纯或化合生产的金属、合金及金属化合物，不包括铁（详见1080201）、铁合金（详见1080208）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2369', '金属制品', '1080400000000000000', '2000', '1,2000,2369', '3', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2370', '金属结构', '1080401000000000000', '2369', '1,2000,2369,2370', '4', '0', '1', 'trade', '包括钢结构及其产品、锌制建筑结构体及其部件、预制建筑物（活动房屋）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2371', '钢结构及其产品', '1080401010000000000', '2370', '1,2000,2369,2370,2371', '5', '0', '1', 'trade', '包括钢结构所用的已加工的各种型钢，不包括货架（详见109011602）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2372', '锌制建筑结构体及其部件', '1080401020000000000', '2370', '1,2000,2369,2370,2372', '5', '0', '1', 'trade', '包括锌制檐槽、屋顶构件、暖房框架及房屋的其他锌制部件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2373', '金属结构预制建筑物（活动房屋）', '1080401030000000000', '2370', '1,2000,2369,2370,2373', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2374', '金属门窗及类似制品', '1080402000000000000', '2369', '1,2000,2369,2374', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2375', '金属制门及其框架、门槛', '1080402010000000000', '2374', '1,2000,2369,2374,2375', '5', '0', '1', 'trade', '包括钢铁门及其框架、门槛、铝制门及其框架、门槛', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2376', '金属制窗及窗框', '1080402020000000000', '2374', '1,2000,2369,2374,2376', '5', '0', '1', 'trade', '包括钢铁制窗及窗框、铝制窗及窗框', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2377', '金属护栏及类似品', '1080402030000000000', '2374', '1,2000,2369,2374,2377', '5', '0', '1', 'trade', '包括金属制窗护网、栏、金属制阳台护栏及类似品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2378', '金属切削工具', '1080403000000000000', '2369', '1,2000,2369,2378', '4', '0', '1', 'trade', '包括金属切削机床用切削刀具、工具系统、机器用刀具及刀片', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2379', '金属切削机床用切削刀具', '1080403010000000000', '2378', '1,2000,2369,2378,2379', '5', '0', '1', 'trade', '包括高速钢与硬质合金材料的刀具等', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2380', '工具系统', '1080403020000000000', '2378', '1,2000,2369,2378,2380', '5', '0', '1', 'trade', '包括组合刀具、复合刀具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2381', '机器用刀具及刀片', '1080403030000000000', '2378', '1,2000,2369,2378,2381', '5', '0', '1', 'trade', '指未装配的机器或机械器具的刀具及刀片', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2382', '其他金属切削工具', '1080403990000000000', '2378', '1,2000,2369,2378,2382', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2383', '通用手工具', '1080404000000000000', '2369', '1,2000,2369,2383', '4', '0', '1', 'trade', '包括手工锯、锉及类似工具、钳子及类似工具、手动扳手及扳钳、锤子、螺丝刀、钻孔或攻丝工具、切管器及类似手工工具、白铁剪及类似工具、打孔冲及类似手工工具、通用手工具可互换部件、专用手工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2384', '手工锯', '1080404010000000000', '2383', '1,2000,2369,2383,2384', '5', '0', '1', 'trade', '指锯木材、金属、石料或其他材料的手工锯，不论是专业用还是家庭用', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2385', '锉及类似工具', '1080404020000000000', '2383', '1,2000,2369,2383,2385', '5', '0', '1', 'trade', '指钢锉、木锉、钢木两用锉及类似工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2386', '钳子', '1080404030000000000', '2383', '1,2000,2369,2383,2386', '5', '0', '1', 'trade', '指以夹钳原理操作的颚式工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2387', '手动扳手及扳钳', '1080404040000000000', '2383', '1,2000,2369,2383,2387', '5', '0', '1', 'trade', '包括各种手动扳手及扳钳，不包括消防用扳手及板钳（详见109025305）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2388', '锤子', '1080404050000000000', '2383', '1,2000,2369,2383,2388', '5', '0', '1', 'trade', '包括碎石锤、大木锤、石材修整锤、其他锤子', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2389', '螺丝刀', '1080404060000000000', '2383', '1,2000,2369,2383,2389', '5', '0', '1', 'trade', '螺丝刀又称起子或改锥，是用来紧固或拆卸带槽螺钉的常用工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2390', '钻孔或攻丝工具', '1080404070000000000', '2383', '1,2000,2369,2383,2390', '5', '0', '1', 'trade', '包括手摇曲柄钻、胸压式手摇钻及手钻、板牙铰手、丝锥扳手、搓丝板', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2391', '切管器及类似手工工具', '1080404080000000000', '2383', '1,2000,2369,2383,2391', '5', '0', '1', 'trade', '包括钳式切管器（带切割轮）、螺栓切头器、螺栓剪钳、链条切割器、其他切管器及类似手工工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2392', '白铁剪及类似工具', '1080404090000000000', '2383', '1,2000,2369,2383,2392', '5', '0', '1', 'trade', '包括平头剪、切割剪、其他白铁剪及类似工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2393', '打孔冲及类似手工工具', '1080404100000000000', '2383', '1,2000,2369,2383,2393', '5', '0', '1', 'trade', '包括钮孔冲孔器、剪票钳、鞍工冲子、其他打孔冲及类似手工工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2394', '通用手工具可互换部件', '1080404110000000000', '2383', '1,2000,2369,2383,2394', '5', '0', '1', 'trade', '包括锯片、带锯片、圆锯片、链锯条、直锯片、其他锯片、可互换扳手套筒、其他通用手工具可互换部件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2395', '专用手工具', '1080404120000000000', '2383', '1,2000,2369,2383,2395', '5', '0', '1', 'trade', '不包括消防、防爆专用手工工具（详见109025405）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2396', '农林、畜牧用金属工具', '1080405000000000000', '2369', '1,2000,2369,2396', '4', '0', '1', 'trade', '包括农林牧通用金属手工具、林业、园艺专用工具、畜牧专用手工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2397', '农林牧通用金属手工具', '1080405010000000000', '2396', '1,2000,2369,2396,2397', '5', '0', '1', 'trade', '包括锹及铲、叉、镐、锄、耙、斧子、钩刀、砍刀类似砍伐工具、镰刀、秣刀、其他农林牧通用金属手工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2398', '林业、园艺专用工具', '1080405020000000000', '2396', '1,2000,2369,2396,2398', '5', '0', '1', 'trade', '包括种植器、播种器、点播器、泥铲及移植器、摘果器、其他林业用器类工具、单手操作剪刀、双手操作剪刀、其他园艺专用刀剪手工具、伐木楔子、木钩、木钳、木镐、其他伐木专用工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2399', '畜牧专用手工具', '1080405030000000000', '2396', '1,2000,2369,2396,2399', '5', '0', '1', 'trade', '包括畜牧专用剪刀、马鬃剪、马蹄剪、羊毛剪、其他畜牧专用剪刀、羊毛抓子、动物用标记钳、牛梳、马梳及猪刮子、其他畜牧专用手工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2400', '其他农林、畜牧用金属工具', '1080405990000000000', '2396', '1,2000,2369,2396,2400', '5', '0', '1', 'trade', '包括犁铧、铡刀等农具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2401', '专用刀具及类似器具', '1080406000000000000', '2369', '1,2000,2369,2401', '4', '0', '1', 'trade', '指游牧及其他特殊人员使用的金属制长刀、短刀、匕首及类似锐利器具，以及舞台、装饰用刀具和类似器具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2402', '刀剪及类似日用金属工具', '1080407000000000000', '2369', '1,2000,2369,2402', '4', '0', '1', 'trade', '包括剪刀及类似品、日常用刀及类似制品、理发用手工具、修饰用手工具、其他刀剪及类似日用金属工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2403', '剪刀及类似品', '1080407010000000000', '2402', '1,2000,2369,2402,2403', '5', '0', '1', 'trade', '不包括农林牧渔用剪刀手工具（详见1080405），也不包括电工用剪刀及裁剪金属用剪刀（详见1090132）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2404', '日常用刀及类似制品', '1080407020000000000', '2402', '1,2000,2369,2402,2404', '5', '0', '1', 'trade', '指有刃口的刀及其刀片和利口器，指机器或机械器具的刀及刀片除外（详见108040303）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2405', '理发用手工具', '1080407030000000000', '2402', '1,2000,2369,2402,2405', '5', '0', '1', 'trade', '不包括电动理发用工具(详见1090419)', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2406', '修饰用手工具', '1080407040000000000', '2402', '1,2000,2369,2402,2406', '5', '0', '1', 'trade', '包括美容修饰用工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2407', '其他刀剪及类似日用金属工具', '1080407990000000000', '2402', '1,2000,2369,2402,2407', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2408', '喷灯、台钳，相关金属手工具', '1080408000000000000', '2369', '1,2000,2369,2408', '4', '0', '1', 'trade', '包括喷灯、台钳及类似制品、其他相关金属手工具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2409', '集装箱', '1080409000000000000', '2369', '1,2000,2369,2409', '4', '0', '1', 'trade', '包括邮政集装箱、运输液体的集装箱', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2410', '金属容器', '1080410000000000000', '2369', '1,2000,2369,2410', '4', '0', '1', 'trade', '包括金属压力容器、包装容器及其附件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2411', '金属丝', '1080411000000000000', '2369', '1,2000,2369,2411', '4', '0', '1', 'trade', '包括铁丝、钢丝、铜丝、铝丝、铅丝、锌丝、镍丝、锡丝、钛丝、镁丝、金丝、银丝、钨丝、钼丝、铂丝、钯丝、铑丝、铱丝、钌丝、其他金属丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2412', '铁丝', '1080411010000000000', '2411', '1,2000,2369,2411,2412', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2413', '钢丝', '1080411020000000000', '2411', '1,2000,2369,2411,2413', '5', '0', '1', 'trade', '包括非合金钢钢丝、低合金钢钢丝、合金、钢钢丝、不锈钢钢丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2414', '铜丝', '1080411030000000000', '2411', '1,2000,2369,2411,2414', '5', '0', '1', 'trade', '包括铜合金丝、铜合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2415', '铝丝', '1080411040000000000', '2411', '1,2000,2369,2411,2415', '5', '0', '1', 'trade', '包括非合金铝丝、铝合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2416', '铅丝', '1080411050000000000', '2411', '1,2000,2369,2411,2416', '5', '0', '1', 'trade', '包括非合金铅丝、铅合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2417', '锌丝', '1080411060000000000', '2411', '1,2000,2369,2411,2417', '5', '0', '1', 'trade', '包括非合金锌丝、锌合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2418', '镍丝', '1080411070000000000', '2411', '1,2000,2369,2411,2418', '5', '0', '1', 'trade', '包括非合金镍丝、镍合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2419', '锡丝', '1080411080000000000', '2411', '1,2000,2369,2411,2419', '5', '0', '1', 'trade', '包括非锡合金丝、锡合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2420', '钛丝', '1080411090000000000', '2411', '1,2000,2369,2411,2420', '5', '0', '1', 'trade', '包括非合金钛丝、钛合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2421', '镁丝', '1080411100000000000', '2411', '1,2000,2369,2411,2421', '5', '0', '1', 'trade', '包括非合金镁丝、镁合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2422', '金丝', '1080411110000000000', '2411', '1,2000,2369,2411,2422', '5', '0', '1', 'trade', '包括纯金丝、金合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2423', '银丝', '1080411120000000000', '2411', '1,2000,2369,2411,2423', '5', '0', '1', 'trade', '包括纯银丝、银合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2424', '钨丝', '1080411130000000000', '2411', '1,2000,2369,2411,2424', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2425', '钼丝', '1080411140000000000', '2411', '1,2000,2369,2411,2425', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2426', '铂丝', '1080411150000000000', '2411', '1,2000,2369,2411,2426', '5', '0', '1', 'trade', '包括非合金铂丝、铂合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2427', '钯丝', '1080411160000000000', '2411', '1,2000,2369,2411,2427', '5', '0', '1', 'trade', '包括非合金钯丝、钯合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2428', '铑丝', '1080411170000000000', '2411', '1,2000,2369,2411,2428', '5', '0', '1', 'trade', '包括非合金铑丝、铑合金丝', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2429', '铱丝', '1080411180000000000', '2411', '1,2000,2369,2411,2429', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2430', '钌丝', '1080411190000000000', '2411', '1,2000,2369,2411,2430', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2431', '其他金属丝', '1080411990000000000', '2411', '1,2000,2369,2411,2431', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2432', '金属制绳、缆', '1080412000000000000', '2369', '1,2000,2369,2432', '4', '0', '1', 'trade', '指非绝缘的金属制绳、缆、带，不包括裸电线（详见109040901）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2433', '钢铁制绳、缆、带', '1080412010000000000', '2432', '1,2000,2369,2432,2433', '5', '0', '1', 'trade', '包括钢丝绳、钢绞线、钢绳缆、钢铁编带、钢丝绳吊具、其他钢铁制绳、缆、带', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2434', '铜丝绞线、缆、编带', '1080412020000000000', '2432', '1,2000,2369,2432,2434', '5', '0', '1', 'trade', '包括铜丝绞线、缆、编带、铜丝绞线、铜丝缆、铜丝编带', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2435', '铝制绞股线、缆、编带', '1080412030000000000', '2432', '1,2000,2369,2432,2435', '5', '0', '1', 'trade', '包括铝制绞股线、缆、编带、钢芯铝绞股线、钢芯铝制缆、钢芯铝制编带及类似品、其他铝制绞股线、缆、编带', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2436', '铅绞线、束或绳', '1080412040000000000', '2432', '1,2000,2369,2432,2436', '5', '0', '1', 'trade', '指用于包装或管子接口堵缝的铅线绞、束或绳', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2437', '其他金属制绳、缆', '1080412990000000000', '2432', '1,2000,2369,2432,2437', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2438', '金属丝绳制品', '1080413000000000000', '2369', '1,2000,2369,2438', '4', '0', '1', 'trade', '包括金属丝制的布、网、篱、格栅', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2439', '钢铁丝制品', '1080413010000000000', '2438', '1,2000,2369,2438,2439', '5', '0', '1', 'trade', '包括钢铁丝环形带、钢丝布、钢铁丝网、钢铁丝篱及格栅、网眼钢铁板、围篱用钢铁带及丝、其他钢铁丝制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2440', '铜丝制品', '1080413020000000000', '2438', '1,2000,2369,2438,2440', '5', '0', '1', 'trade', '包括铜丝布（包括环型带）、网、格栅', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2441', '铝丝制品', '1080413030000000000', '2438', '1,2000,2369,2438,2441', '5', '0', '1', 'trade', '包括铝丝布、格栅、网及栏栅及类似铝丝制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2442', '镍丝制品', '1080413040000000000', '2438', '1,2000,2369,2438,2442', '5', '0', '1', 'trade', '包括镍丝布、格栅及网', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2443', '锌丝制品', '1080413050000000000', '2438', '1,2000,2369,2438,2443', '5', '0', '1', 'trade', '包括锌丝制的布、网、篱、格栅以及网眼锌板', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2444', '其他金属丝绳制品', '1080413990000000000', '2438', '1,2000,2369,2438,2444', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2445', '金属紧固件、金属钉', '1080414000000000000', '2369', '1,2000,2369,2445', '4', '0', '1', 'trade', '包括金属制螺钉、螺栓、螺母、铆钉、销挡圈', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2446', '钢铁制紧固件', '1080414010000000000', '2445', '1,2000,2369,2445,2446', '5', '0', '1', 'trade', '包括螺钉、螺栓、螺母、钢铁制垫圈、铆钉、开尾销、销及锥形销、簧环、其他钢铁制紧固件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2447', '铜制紧固件', '1080414020000000000', '2445', '1,2000,2369,2445,2447', '5', '0', '1', 'trade', '包括铜制螺钉、铜制木螺钉、其他铜制螺钉、铜制螺栓、铜制螺母、铜制垫圈、其他铜制紧固件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2448', '铝制紧固件', '1080414030000000000', '2445', '1,2000,2369,2445,2448', '5', '0', '1', 'trade', '包括铝制螺钉、铝制螺栓、铝制螺母、铝制铆钉、其他铝制紧固件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2449', '其他金属紧固件', '1080414040000000000', '2445', '1,2000,2369,2445,2449', '5', '0', '1', 'trade', '指除钢铁制紧固件（详见108041401）、铜制紧固件（详见108041402）、铝制紧固件（详见108041403）以外的金属紧固件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2450', '金属钉', '1080414050000000000', '2445', '1,2000,2369,2445,2450', '5', '0', '1', 'trade', '包括钢铁制钉、铜制钉、铝制钉、其他金属钉', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2451', '弹簧', '1080415000000000000', '2369', '1,2000,2369,2451', '4', '0', '1', 'trade', '包括钢铁制弹簧、铜弹簧', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2452', '钢铁制弹簧', '1080415010000000000', '2451', '1,2000,2369,2451,2452', '5', '0', '1', 'trade', '包括钢铁制弹簧及弹簧片', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2453', '铜弹簧', '1080415020000000000', '2451', '1,2000,2369,2451,2453', '5', '0', '1', 'trade', '包括磷青铜弹簧、铍铜弹簧、铝青铜弹簧、硅青铜弹簧、黄铜弹簧、德银弹簧、其他铜弹簧', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2454', '锁及其附件', '1080416000000000000', '2369', '1,2000,2369,2454', '4', '0', '1', 'trade', '包括金属制的锁及带锁的扣环及扣环框架和钥匙', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2455', '家具、建筑用金属附件及架座；金属制建筑装饰及其零件', '1080417000000000000', '2369', '1,2000,2369,2455', '4', '0', '1', 'trade', '包括用于家具、门窗、箱等的贱金属附件及架座', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2456', '散热器及其零件', '1080418000000000000', '2369', '1,2000,2369,2456', '4', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2457', '供暖用散热器（暖气片）', '1080418010000000000', '2456', '1,2000,2369,2456,2457', '5', '0', '1', 'trade', '指集中供暖用散热器；包括非电热的钢铁制集中供暖用散热器及其零件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2458', '暖气分布器及零件', '1080418020000000000', '2456', '1,2000,2369,2456,2458', '5', '0', '1', 'trade', '指非电热钢铁制暖气分布器及零件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2459', '其他散热器及其零件', '1080418990000000000', '2456', '1,2000,2369,2456,2459', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2460', '安全、消防用金属制品', '1080419000000000000', '2369', '1,2000,2369,2460', '4', '0', '1', 'trade', '包括保险箱、柜、库门及钱箱、文件、档案柜、金属制安全帽、其他安全、消防用金属制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2461', '保险箱、柜、库门及钱箱', '1080419010000000000', '2460', '1,2000,2369,2460,2461', '5', '0', '1', 'trade', '指其壁已装甲（即用高强度合金钢铠装）的或其钢板已用钢筋混凝土等加强的用以保管贵重物品、珠宝首饰、文件等，可防盗防火的钢制容器及保险库的门', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2462', '文件、档案柜', '1080419020000000000', '2460', '1,2000,2369,2460,2462', '5', '0', '1', 'trade', '指非落地式的文件、档案柜，落地式的文件档案柜（详见108041901）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2463', '金属制安全帽', '1080419030000000000', '2460', '1,2000,2369,2460,2463', '5', '0', '1', 'trade', '不包括体育专用头盔（详见106040606）', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2464', '其他安全、消防用金属制品', '1080419990000000000', '2460', '1,2000,2369,2460,2464', '5', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2465', '搪瓷制品', '1080420000000000000', '2369', '1,2000,2369,2465', '4', '0', '1', 'trade', '包括工业生产配套用搪瓷制品、搪瓷洗涤器具、医、疗、卫生用搪瓷制品、搪瓷制厨房用具、搪瓷餐具、搪瓷铸铁制厨房、餐桌用具、其他搪瓷制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2466', '金属制卫生器具', '1080421000000000000', '2369', '1,2000,2369,2466', '4', '0', '1', 'trade', '指供水或接受、排出污水或污物的金属容器或装置。包括便溺用金属卫生器具：如大便器、小便器等；盥洗、淋浴用金属卫生器具：如洗脸盆、淋浴器等；洗涤用卫生器具：如洗涤盆、污水盆等；专用金属卫生器具：如医疗、科学研究实验室等特殊需要的卫生器具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2467', '金属制烹饪炊具', '1080422000000000000', '2369', '1,2000,2369,2467', '4', '0', '1', 'trade', '包括钢铝复合底炒锅、煎锅等锅具', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2468', '金属制餐具', '1080423000000000000', '2369', '1,2000,2369,2468', '4', '0', '1', 'trade', '指以金属或其合金为基本材料制成的食器', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2469', '金属制日用杂品', '1080424000000000000', '2369', '1,2000,2369,2469', '4', '0', '1', 'trade', '包括金属制烟具及类似制品、金属制缝衣针及类似制品、服装、鞋帽及类似品金属附件、厨房用金属丝绒、擦锅器、非电动金属制铃、钟、锣、铝箔纸制品、金属制普通标牌、奖杯、奖章及类似品、金属制钥匙扣及类似品、其他金属制日用杂品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2470', '铸币及贵金属制实验室用品', '1080425000000000000', '2369', '1,2000,2369,2470', '4', '0', '1', 'trade', '包括硬币、工业或实验室用贵金属制品、贵金属或包贵金属制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2471', '金属焊接材料', '1080426000000000000', '2369', '1,2000,2369,2471', '4', '0', '1', 'trade', '包括金属、硬质合金焊接丝、条、管、板及类似品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2472', '金属链条及零件', '1080427000000000000', '2369', '1,2000,2369,2472', '4', '0', '1', 'trade', '包括金属链条、金属链零件', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2473', '其他金属制品', '1080499000000000000', '2369', '1,2000,2369,2473', '4', '0', '1', 'trade', '包括金属真空容器、其他未列明金属制品', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('2474', '核燃料', '1080500000000000000', '2000', '1,2000,2474', '3', '0', '1', 'trade', '', '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8197', '长期客户', '', '0', '', '1', '0', '1', 'customertype', null, '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8198', '协议客户', '', '0', '', '1', '0', '1', 'customertype', null, '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8199', '国内供应商', '', '0', '', '1', '0', '1', 'supplytype', null, '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8200', '国外供应商', '', '0', '', '1', '0', '1', 'supplytype', null, '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8201', '管理费用', '', '0', '', '1', '0', '1', 'paccttype', null, '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8202', '销售收入', '', '0', '', '1', '0', '1', 'raccttype', null, '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8203', '现金', '', '0', '', '1', '0', '1', 'PayMethod', null, '1', '0', '0');
INSERT INTO `ci_category` VALUES ('8204', '支票', '', '0', '', '1', '0', '1', 'PayMethod', null, '1', '0', '0');


-- ----------------------------
-- Table structure for `ci_contact`
-- ----------------------------
DROP TABLE IF EXISTS `ci_contact`;
CREATE TABLE `ci_contact` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '0' COMMENT '客户名称',
  `number` varchar(50) DEFAULT '0' COMMENT '客户编号',
  `cCategory` smallint(6) DEFAULT '0' COMMENT '客户类别',
  `cCategoryName` varchar(50) DEFAULT '' COMMENT '分类名称',
  `taxRate` double DEFAULT '0' COMMENT '税率',
  `amount` double DEFAULT '0' COMMENT '期初应付款',
  `periodMoney` double DEFAULT '0' COMMENT '期初预付款',
  `difMoney` double DEFAULT '0' COMMENT '初期往来余额',
  `beginDate` date DEFAULT NULL COMMENT '余额日期',
  `remark` varchar(100) DEFAULT '' COMMENT '备注',
  `linkMans` text COMMENT '客户联系方式',
  `type` tinyint(1) DEFAULT '-10' COMMENT '-10客户  10供应商',
  `contact` varchar(255) DEFAULT '',
  `cLevel` smallint(5) DEFAULT '1' COMMENT '客户等级ID',
  `cLevelName` varchar(50) DEFAULT '' COMMENT '客户等级',
  `pinYin` varchar(50) DEFAULT '',
  `disable` tinyint(1) DEFAULT '0' COMMENT '0启用   1禁用',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '0正常 1删除',
  PRIMARY KEY (`id`),
  KEY `number` (`number`),
  KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `ci_goods`
-- ----------------------------
DROP TABLE IF EXISTS `ci_goods`;
CREATE TABLE `ci_goods` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT '',
  `number` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '商品编号',
  `quantity` double DEFAULT '0' COMMENT '起初数量',
  `spec` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '规格',
  `baseUnitId` smallint(6) DEFAULT '0' COMMENT '单位ID',
  `unitName` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '单位名称',
  `categoryId` smallint(6) DEFAULT '0' COMMENT '商品分类ID',
  `categoryName` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '分类名称',
  `purPrice` double DEFAULT '0' COMMENT '预计采购价',
  `salePrice` double DEFAULT '0' COMMENT '预计销售价',
  `unitCost` double DEFAULT '0' COMMENT '单位成本',
  `amount` double DEFAULT '0' COMMENT '期初总价',
  `remark` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `status` tinyint(1) DEFAULT '1' COMMENT '状态',
  `goods` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `propertys` text CHARACTER SET utf8 COLLATE utf8_unicode_ci COMMENT '初期设置',
  `vipPrice` double DEFAULT '0' COMMENT '会员价',
  `lowQty` double DEFAULT '0',
  `length` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `height` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `highQty` double DEFAULT '0',
  `isSerNum` double DEFAULT '0',
  `barCode` varchar(60) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `discountRate1` double DEFAULT '0' COMMENT '0',
  `discountRate2` double DEFAULT '0',
  `locationId` int(11) DEFAULT '0',
  `locationName` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `wholesalePrice` double DEFAULT '0',
  `width` varchar(15) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `skuAssistId` text CHARACTER SET utf8 COLLATE utf8_unicode_ci COMMENT '辅助属性分类',
  `pinYin` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `unitId` smallint(6) DEFAULT '0',
  `files` text CHARACTER SET utf8 COLLATE utf8_unicode_ci COMMENT '图片路径',
  `disable` tinyint(1) DEFAULT '0' COMMENT '0启用   1禁用',
  `unitTypeId` int(11) DEFAULT '0',
  `assistIds` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `assistName` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `assistUnit` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `jianxing` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `josl` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `skuClassId` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `property` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `safeDays` double DEFAULT '0',
  `advanceDay` double DEFAULT '0',
  `isWarranty` double DEFAULT '0',
  `delete` int(11) DEFAULT '0',
  `weight` double DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '0正常  1删除',
  `warehouseWarning` text,
  PRIMARY KEY (`id`),
  KEY `number` (`number`),
  KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `ci_goods_img`
-- ----------------------------
DROP TABLE IF EXISTS `ci_goods_img`;
CREATE TABLE `ci_goods_img` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT '' COMMENT '名称',
  `invId` int(11) DEFAULT '0',
  `type` varchar(100) DEFAULT '',
  `url` varchar(255) DEFAULT '',
  `thumbnailUrl` varchar(255) DEFAULT '',
  `size` int(11) DEFAULT '0',
  `deleteUrl` varchar(255) DEFAULT '',
  `deleteType` varchar(50) DEFAULT '',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `invId` (`invId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_goods_img
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_invoice`
-- ----------------------------
DROP TABLE IF EXISTS `ci_invoice`;
CREATE TABLE `ci_invoice` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `buId` smallint(6) DEFAULT '0' COMMENT '供应商ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '单据编号',
  `uid` smallint(6) DEFAULT '0',
  `userName` varchar(50) DEFAULT '' COMMENT '制单人',
  `transType` int(11) DEFAULT '0' COMMENT '150501购货 150502退货 150601销售 150602退销 150706其他入库',
  `totalAmount` double DEFAULT '0' COMMENT '购货总金额',
  `amount` double DEFAULT '0' COMMENT '折扣后金额',
  `rpAmount` double DEFAULT '0' COMMENT '本次付款',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `description` varchar(100) DEFAULT '' COMMENT '备注',
  `arrears` double DEFAULT '0' COMMENT '本次欠款',
  `disRate` double DEFAULT '0' COMMENT '折扣率',
  `disAmount` double DEFAULT '0' COMMENT '折扣金额',
  `totalQty` double DEFAULT '0' COMMENT '总数量',
  `totalArrears` double DEFAULT '0',
  `billStatus` tinyint(1) DEFAULT '0' COMMENT '订单状态 ',
  `checkName` varchar(50) DEFAULT '' COMMENT '采购单审核人',
  `totalTax` double DEFAULT '0',
  `totalTaxAmount` double DEFAULT '0',
  `checked` tinyint(1) DEFAULT '0' COMMENT '采购单状态',
  `accId` tinyint(4) DEFAULT '0' COMMENT '结算账户ID',
  `billType` varchar(20) DEFAULT '' COMMENT 'PO采购订单 OI其他入库 PUR采购入库 BAL初期余额',
  `modifyTime` datetime DEFAULT NULL COMMENT '更新时间',
  `hxStateCode` tinyint(4) DEFAULT '0' COMMENT '0未付款  1部分付款  2全部付款',
  `transTypeName` varchar(20) DEFAULT '',
  `totalDiscount` double DEFAULT '0',
  `salesId` smallint(6) DEFAULT '0' COMMENT '销售人员ID',
  `customerFree` double DEFAULT '0' COMMENT '客户承担费用',
  `hxAmount` double DEFAULT '0' COMMENT '本次核销金额',
  `hasCheck` double DEFAULT '0' COMMENT '已核销',
  `notCheck` double DEFAULT '0' COMMENT '未核销',
  `nowCheck` double DEFAULT '0' COMMENT '本次核销',
  `payment` double DEFAULT '0' COMMENT '本次预收款',
  `discount` double DEFAULT '0' COMMENT '整单折扣',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '1删除  0正常',
  `srcOrderId` int(11) DEFAULT '0',
  `srcOrderNo` varchar(30) DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `accId` (`accId`),
  KEY `buId` (`buId`),
  KEY `salesId` (`salesId`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;


-- ----------------------------
-- Table structure for `ci_invoice_info`
-- ----------------------------
DROP TABLE IF EXISTS `ci_invoice_info`;
CREATE TABLE `ci_invoice_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `iid` int(11) DEFAULT '0' COMMENT '关联ID',
  `buId` smallint(6) DEFAULT '0' COMMENT '供应商ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '单据编号',
  `transType` int(11) DEFAULT '0' COMMENT '150501采购 150502退货',
  `amount` double DEFAULT '0' COMMENT '购货金额',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `description` varchar(50) DEFAULT '' COMMENT '备注',
  `invId` int(11) DEFAULT '0' COMMENT '商品ID',
  `price` double DEFAULT '0' COMMENT '单价',
  `deduction` double DEFAULT '0' COMMENT '折扣额',
  `discountRate` double DEFAULT '0' COMMENT '折扣率',
  `qty` double DEFAULT '0' COMMENT '数量',
  `locationId` smallint(6) DEFAULT '0',
  `tax` double DEFAULT '0',
  `taxRate` double DEFAULT '0',
  `taxAmount` double DEFAULT '0',
  `unitId` smallint(6) DEFAULT '0',
  `skuId` int(11) DEFAULT '0',
  `entryId` tinyint(1) DEFAULT '1' COMMENT '区分调拨单  进和出',
  `transTypeName` varchar(25) DEFAULT '',
  `srcOrderEntryId` int(11) DEFAULT '0',
  `srcOrderId` int(11) DEFAULT '0',
  `srcOrderNo` varchar(25) DEFAULT '',
  `billType` varchar(20) DEFAULT '',
  `checked` tinyint(1) DEFAULT '0' COMMENT '0 1',
  `checkName` varchar(30) DEFAULT '',
  `salesId` smallint(6) DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '1删除 0正常',
  PRIMARY KEY (`id`),
  KEY `type` (`transType`),
  KEY `billdate` (`billDate`),
  KEY `invId` (`invId`) USING BTREE,
  KEY `transType` (`transType`),
  KEY `iid` (`iid`),
  KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;


-- ----------------------------
-- Table structure for `ci_invoice_type`
-- ----------------------------
DROP TABLE IF EXISTS `ci_invoice_type`;
CREATE TABLE `ci_invoice_type` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT '' COMMENT '名称',
  `inout` tinyint(1) DEFAULT '1' COMMENT '1 入库  -1出库',
  `status` tinyint(1) DEFAULT '1',
  `type` varchar(10) DEFAULT '',
  `default` tinyint(1) DEFAULT '0',
  `number` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_invoice_type
-- ----------------------------
INSERT INTO `ci_invoice_type` VALUES ('1', '其他入库', '1', '1', 'in', '1', '150706');
INSERT INTO `ci_invoice_type` VALUES ('2', '盘盈', '1', '1', 'in', '0', '150701');
INSERT INTO `ci_invoice_type` VALUES ('3', '其他出库', '-1', '1', 'out', '1', '150806');
INSERT INTO `ci_invoice_type` VALUES ('4', '盘亏', '-1', '1', 'out', '0', '150801');

-- ----------------------------
-- Table structure for `ci_invps`
-- ----------------------------
DROP TABLE IF EXISTS `ci_invps`;
CREATE TABLE `ci_invps` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `buId` smallint(6) DEFAULT '0' COMMENT '供应商ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '单据编号',
  `uid` smallint(6) DEFAULT '0',
  `userName` varchar(50) DEFAULT '' COMMENT '制单人',
  `transType` int(11) DEFAULT '0' COMMENT '150501购货 150502退货 150601销售 150602退销 150706其他入库',
  `totalAmount` double DEFAULT '0' COMMENT '购货总金额',
  `amount` double DEFAULT '0' COMMENT '折扣后金额',
  `rpAmount` double DEFAULT '0' COMMENT '本次付款',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `description` varchar(100) DEFAULT '' COMMENT '备注',
  `arrears` double DEFAULT '0' COMMENT '本次欠款',
  `disRate` double DEFAULT '0' COMMENT '折扣率',
  `disAmount` double DEFAULT '0' COMMENT '折扣金额',
  `totalQty` double DEFAULT '0' COMMENT '总数量',
  `totalArrears` double DEFAULT '0',
  `billStatus` tinyint(1) DEFAULT '0' COMMENT '订单状态 0未入库  1 2全部入库',
  `checkName` varchar(50) DEFAULT '' COMMENT '采购单审核人',
  `totalTax` double DEFAULT '0',
  `totalTaxAmount` double DEFAULT '0',
  `checked` tinyint(1) DEFAULT '0' COMMENT '采购单状态',
  `accId` tinyint(4) DEFAULT '0' COMMENT '结算账户ID',
  `billType` varchar(20) DEFAULT '' COMMENT 'PO采购订单 OI其他入库 PUR采购入库 BAL初期余额',
  `modifyTime` datetime DEFAULT NULL COMMENT '更新时间',
  `hxStateCode` tinyint(4) DEFAULT '0' COMMENT '0未付款  1部分付款  2全部付款',
  `transTypeName` varchar(20) DEFAULT '',
  `totalDiscount` double DEFAULT '0',
  `salesId` smallint(6) DEFAULT '0' COMMENT '销售人员ID',
  `customerFree` double DEFAULT '0' COMMENT '客户承担费用',
  `hxAmount` double DEFAULT '0' COMMENT '本次核销金额',
  `hasCheck` double DEFAULT '0' COMMENT '已核销',
  `notCheck` double DEFAULT '0' COMMENT '未核销',
  `nowCheck` double DEFAULT '0' COMMENT '本次核销',
  `payment` double DEFAULT '0' COMMENT '本次预收款',
  `discount` double DEFAULT '0' COMMENT '整单折扣',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '1删除  0正常',
  `deliveryDate` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `accId` (`accId`),
  KEY `buId` (`buId`),
  KEY `salesId` (`salesId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_invps
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_invps_info`
-- ----------------------------
DROP TABLE IF EXISTS `ci_invps_info`;
CREATE TABLE `ci_invps_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `iid` int(11) DEFAULT '0' COMMENT '关联ID',
  `buId` smallint(6) DEFAULT '0' COMMENT '供应商ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '单据编号',
  `transType` int(11) DEFAULT '0' COMMENT '150501采购 150502退货',
  `amount` double DEFAULT '0' COMMENT '购货金额',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `description` varchar(50) DEFAULT '' COMMENT '备注',
  `invId` int(11) DEFAULT '0' COMMENT '商品ID',
  `price` double DEFAULT '0' COMMENT '单价',
  `deduction` double DEFAULT '0' COMMENT '折扣额',
  `discountRate` double DEFAULT '0' COMMENT '折扣率',
  `qty` double DEFAULT '0' COMMENT '数量',
  `locationId` smallint(6) DEFAULT '0',
  `tax` double DEFAULT '0',
  `taxRate` double DEFAULT '0',
  `taxAmount` double DEFAULT '0',
  `unitId` smallint(6) DEFAULT '0',
  `skuId` int(11) DEFAULT '0',
  `entryId` tinyint(1) DEFAULT '1' COMMENT '区分调拨单  进和出',
  `transTypeName` varchar(25) DEFAULT '',
  `srcOrderEntryId` int(11) DEFAULT '0',
  `srcOrderId` int(11) DEFAULT '0',
  `srcOrderNo` varchar(25) DEFAULT '',
  `billType` varchar(20) DEFAULT '',
  `checked` tinyint(1) DEFAULT '0' COMMENT '0 1',
  `checkName` varchar(30) DEFAULT '',
  `salesId` smallint(6) DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '1删除 0正常',
  PRIMARY KEY (`id`),
  KEY `type` (`transType`),
  KEY `billdate` (`billDate`),
  KEY `invId` (`invId`) USING BTREE,
  KEY `transType` (`transType`),
  KEY `iid` (`iid`),
  KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_invps_info
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_log`
-- ----------------------------
DROP TABLE IF EXISTS `ci_log`;
CREATE TABLE `ci_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userId` smallint(6) DEFAULT '0' COMMENT '用户ID',
  `ip` varchar(25) DEFAULT '',
  `name` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '姓名',
  `log` text COMMENT '日志内容',
  `type` tinyint(1) DEFAULT '1' COMMENT ' ',
  `loginName` varchar(50) DEFAULT '' COMMENT '用户名',
  `modifyTime` datetime DEFAULT NULL COMMENT '写入日期',
  `operateTypeName` varchar(50) DEFAULT '',
  `adddate` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `userId` (`userId`),
  KEY `adddate` (`adddate`)
) ENGINE=InnoDB AUTO_INCREMENT=130 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `ci_menu`
-- ----------------------------
DROP TABLE IF EXISTS `ci_menu`;
CREATE TABLE `ci_menu` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT COMMENT '导航栏目',
  `name` varchar(50) COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目名称',
  `parentId` smallint(5) DEFAULT '0' COMMENT '上级栏目ID',
  `path` varchar(100) COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目路径',
  `level` tinyint(2) DEFAULT '1' COMMENT '层次',
  `ordnum` smallint(6) DEFAULT '0' COMMENT '排序',
  `module` varchar(50) COLLATE utf8_unicode_ci DEFAULT '',
  `status` tinyint(1) DEFAULT '1' COMMENT '状态',
  `typeNumber` varchar(25) COLLATE utf8_unicode_ci DEFAULT '',
  `detail` tinyint(1) DEFAULT '1',
  `sortIndex` smallint(6) DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0',
  `remark` varchar(255) COLLATE utf8_unicode_ci DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `parentId` (`parentId`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=203 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of ci_menu
-- ----------------------------
INSERT INTO `ci_menu` VALUES ('1', '购货单', '0', '1', '1', '99', 'PU_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('2', '新增', '1', '1,2', '2', '99', 'PU_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('3', '修改', '1', '1,3', '2', '99', 'PU_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('4', '删除', '1', '1,4', '2', '99', 'PU_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('5', '导出', '1', '1,5', '2', '99', 'PU_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('6', '销货单', '0', '6', '1', '99', 'SA_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('7', '新增', '6', '6,7', '2', '99', 'SA_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('8', '修改', '6', '6,8', '2', '99', 'SA_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('9', '删除', '6', '6,9', '2', '99', 'SA_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('10', '导出', '6', '6,10', '2', '99', 'SA_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('11', '盘点', '0', '11', '1', '99', 'PD_GENPD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('12', '生成盘点记录', '11', '11,12', '2', '99', 'PD_GENPD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('13', '导出', '11', '11,13', '2', '99', 'PD_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('14', '其他入库单', '0', '14', '1', '99', 'IO_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('15', '新增', '14', '14,15', '2', '99', 'IO_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('16', '修改', '14', '14,16', '2', '99', 'IO_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('17', '删除', '14', '14,17', '2', '99', 'IO_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('18', '其他出库单', '0', '18', '1', '99', 'OO_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('19', '新增', '18', '18,19', '2', '99', 'OO_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('20', '修改', '18', '18,20', '2', '99', 'OO_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('21', '删除', '18', '18,21', '2', '99', 'OO_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('22', '采购明细表', '0', '22', '1', '99', 'PUREOORTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('23', '导出', '22', '22,23', '2', '99', 'PUREOORTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('24', '打印', '22', '22,24', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('25', '采购汇总表（按商品）', '0', '25', '1', '99', 'PUREPORTINV_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('26', '导出', '25', '25,26', '2', '99', 'PUREPORTINV_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('27', '打印', '25', '25,27', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('28', '采购汇总表（按供应商）', '0', '28', '1', '99', 'PUREPORTPUR_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('29', '导出', '28', '28,29', '2', '99', 'PUREPORTPUR_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('30', '打印', '28', '28,30', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('31', '销售明细表', '0', '31', '1', '99', 'SAREPORTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('32', '导出', '31', '31,32', '2', '99', 'SAREPORTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('33', '打印', '31', '31,33', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('34', '销售汇总表（按商品）', '0', '34', '1', '99', 'SAREPORTINV_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('35', '导出', '34', '34,35', '2', '99', 'SAREPORTINV_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('36', '打印', '34', '34,36', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('37', '销售汇总表（按客户）', '0', '37', '1', '99', 'SAREPORTBU_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('38', '导出', '37', '37,38', '2', '99', 'SAREPORTBU_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('39', '打印', '37', '37,39', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('40', '商品库存余额表', '0', '40', '1', '99', 'InvBalanceReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('41', '导出', '40', '40,41', '2', '99', 'InvBalanceReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('42', '打印', '40', '40,42', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('43', '商品收发明细表', '0', '43', '1', '99', 'DeliverDetailReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('44', '导出', '43', '43,44', '2', '99', 'DeliverDetailReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('45', '打印', '43', '43,45', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('46', '商品收发汇总表', '0', '46', '1', '99', 'DeliverSummaryReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('47', '导出', '46', '46,47', '2', '99', 'DeliverSummaryReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('48', '打印', '46', '46,48', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('49', '往来单位欠款表', '0', '49', '1', '99', 'ContactDebtReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('50', '导出', '49', '49,50', '2', '99', 'ContactDebtReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('51', '打印', '49', '49,51', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('52', '应付账款明细表', '0', '52', '1', '99', 'PAYMENTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('53', '导出', '52', '52,53', '2', '99', 'PAYMENTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('54', '打印', '52', '52,54', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('55', '应收账款明细表', '0', '55', '1', '99', 'RECEIPTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('56', '导出', '55', '55,56', '2', '99', 'RECEIPTDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('57', '打印', '55', '55,57', '2', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('58', '客户管理', '0', '58', '1', '99', 'BU_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('59', '新增', '58', '58,59', '2', '99', 'BU_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('60', '修改', '58', '58,60', '2', '99', 'BU_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('61', '删除', '58', '58,61', '2', '99', 'BU_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('62', '导出', '58', '58,62', '2', '99', 'BU_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('63', '供应商管理', '0', '63', '1', '99', 'PUR_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('64', '新增', '63', '63,64', '2', '99', 'PUR_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('65', '修改', '63', '63,65', '2', '99', 'PUR_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('66', '删除', '63', '63,66', '2', '99', 'PUR_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('67', '导出', '63', '63,67', '2', '99', 'PUR_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('68', '商品管理', '0', '68', '1', '99', 'INVENTORY_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('69', '新增', '68', '68,69', '2', '99', 'INVENTORY_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('70', '修改', '68', '68,70', '2', '99', 'INVENTORY_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('71', '删除', '68', '68,71', '2', '99', 'INVENTORY_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('72', '导出', '68', '68,72', '2', '99', 'INVENTORY_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('73', '客户类别', '0', '73', '1', '99', 'BUTYPE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('74', '新增', '73', '73,74', '2', '99', 'BUTYPE_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('75', '修改', '73', '73,75', '2', '99', 'BUTYPE_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('76', '删除', '73', '73,76', '2', '99', 'BUTYPE_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('77', '计量单位', '0', '77', '1', '99', 'UNIT_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('78', '新增', '77', '77,78', '2', '99', 'UNIT_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('79', '修改', '77', '77,79', '2', '99', 'UNIT_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('80', '删除', '77', '77,80', '2', '99', 'UNIT_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('81', '系统参数', '0', '81', '1', '99', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('82', '权限设置', '0', '82', '1', '99', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('83', '操作日志', '0', '83', '1', '99', 'OPERATE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('84', '数据备份', '0', '84', '1', '99', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('85', '打印', '1', '1,85', '2', '99', 'PU_PRINT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('86', '审核', '1', '1,86', '2', '0', 'PU_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('87', '反审核', '1', '1,87', '2', '0', 'PU_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('88', '打印', '6', '6,88', '2', '0', 'SA_PRINT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('89', '审核', '6', '6,89', '2', '0', 'SA_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('90', '反审核', '6', '6,90', '2', '0', 'SA_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('91', '禁用', '58', '58,91', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('92', '启用', '58', '58,92', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('93', '禁用', '63', '63,93', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('94', '启用', '63', '63,94', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('95', '禁用', '68', '68,95', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('96', '启用', '68', '68,96', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('97', '职员管理', '0', '97', '1', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('98', '账号管理', '0', '98', '1', '0', 'SettAcct_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('99', '导入', '11', '11,99', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('100', '审核', '14', '14,100', '2', '0', 'IO_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('101', '反审核', '14', '14,101', '2', '0', 'IO_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('102', '导出', '14', '14,102', '2', '0', 'IO_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('103', '审核', '18', '18,103', '2', '0', 'OO_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('104', '反审核', '18', '18,104', '2', '0', 'OO_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('105', '导出', '18', '18,105', '2', '0', 'OO_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('106', '现金银行报表', '0', '106', '1', '0', 'SettAcctReport_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('107', '打印', '106', '106,107', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('108', '导出', '106', '106,108', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('109', '客户对账单', '0', '109', '1', '0', 'CUSTOMERBALANCE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('110', '打印', '109', '109,110', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('111', '导出', '109', '109,111', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('112', '供应商对账单', '0', '112', '1', '0', 'SUPPLIERBALANCE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('113', '打印', '112', '112,113', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('114', '导出', '112', '112,114', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('115', '其他收支明细表', '0', '115', '1', '0', 'ORIDETAIL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('116', '打印', '115', '115,116', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('117', '导出', '115', '115,117', '2', '0', '', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('118', '新增', '97', '97,118', '2', '0', 'INVLOCTION_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('119', '修改', '97', '97,119', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('120', '删除', '97', '97,120', '2', '0', 'INVLOCTION_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('121', '新增', '98', '98,121', '2', '0', 'SettAcct_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('122', '修改', '98', '98,122', '2', '0', 'SettAcct_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('123', '删除', '98', '98,123', '2', '0', 'SettAcct_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('124', '收款单', '0', '124', '1', '0', 'RECEIPT_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('125', '新增', '124', '124,125', '2', '0', 'RECEIPT_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('126', '修改', '124', '124,126', '2', '0', 'RECEIPT_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('127', '删除', '124', '124,127', '2', '0', 'RECEIPT_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('128', '导出', '124', '124,128', '2', '0', 'RECEIPT_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('129', '付款单', '0', '129', '1', '0', 'PAYMENT_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('130', '新增', '129', '129,130', '2', '0', 'PAYMENT_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('131', '修改', '129', '129,131', '2', '0', 'PAYMENT_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('132', '删除', '129', '129,132', '2', '0', 'PAYMENT_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('133', '导出', '129', '129,133', '2', '0', 'PAYMENT_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('134', '其他收入单', '0', '134', '1', '0', 'QTSR_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('135', '新增', '134', '134,135', '2', '0', 'QTSR_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('136', '修改', '134', '134,136', '2', '0', 'QTSR_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('137', '删除', '134', '134,137', '2', '0', 'QTSR_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('138', '导出', '134', '134,138', '2', '0', 'QTSR_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('139', '其他支出单', '0', '139', '1', '0', 'QTZC_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('140', '新增', '139', '139,140', '2', '0', 'QTZC_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('141', '修改', '139', '139,141', '2', '0', 'QTZC_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('142', '删除', '139', '139,142', '2', '0', 'QTZC_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('143', '导出', '139', '139,143', '2', '0', 'QTZC_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('144', '调拨单', '0', '144', '1', '0', 'TF_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('145', '新增', '144', '144,145', '2', '0', 'TF_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('146', '修改', '144', '144,146', '2', '0', 'TF_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('147', '删除', '144', '144,147', '2', '0', 'TF_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('148', '导出', '144', '144,148', '2', '0', 'TF_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('149', '重新初始化', '0', '149', '1', '0', '', '0', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('151', '成本调整单', '0', '151', '1', '0', 'CADJ_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('152', '新增', '151', '151,152', '2', '0', 'CADJ_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('153', '修改', '151', '151,153', '2', '0', 'CADJ_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('154', '删除', '151', '151,154', '2', '0', 'CADJ_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('155', '仓库管理', '0', '155', '1', '0', 'INVLOCTION_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('156', '新增', '155', '155,156', '2', '0', 'INVLOCTION_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('157', '修改', '155', '155,157', '2', '0', 'INVLOCTION_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('158', '删除', '155', '155,158', '2', '0', 'INVLOCTION_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('159', '结算方式', '0', '159', '1', '0', 'Assist_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('160', '新增', '159', '159,160', '2', '0', 'Assist_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('161', '修改', '159', '159,161', '2', '0', 'Assist_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('162', '删除', '159', '159,162', '2', '0', 'Assist_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('163', '供应商类别', '0', '163', '1', '0', 'SUPPLYTYPE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('164', '新增', '163', '163,164', '2', '0', 'SUPPLYTYPE_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('165', '修改', '163', '163,165', '2', '0', 'SUPPLYTYPE_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('166', '删除', '163', '163,166', '2', '0', 'SUPPLYTYPE_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('167', '商品类别', '0', '167', '1', '0', 'TRADETYPE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('168', '新增', '167', '167,168', '2', '0', 'TRADETYPE_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('169', '修改', '167', '167,169', '2', '0', 'TRADETYPE_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('170', '删除', '167', '167,170', '2', '0', 'TRADETYPE_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('171', '支出类别', '0', '171', '1', '0', 'PACCTTYPE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('172', '新增', '171', '171,172', '2', '0', 'PACCTTYPE_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('173', '修改', '171', '171,173', '2', '0', 'PACCTTYPE_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('174', '删除', '171', '171,174', '2', '0', 'PACCTTYPE_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('175', '收入类别', '0', '175', '1', '0', 'RACCTTYPE_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('176', '新增', '175', '175,176', '2', '0', 'RACCTTYPE_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('177', '修改', '175', '175,177', '2', '0', 'RACCTTYPE_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('178', '删除', '175', '175,178', '2', '0', 'RACCTTYPE_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('179', '打印', '144', '144,179', '2', '0', 'TF_PRINT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('180', '采购订单', '0', '180', '1', '0', 'PO_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('181', '新增', '180', '180,181', '2', '0', 'PO_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('182', '修改', '180', '180,182', '2', '0', 'PO_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('183', '删除', '180', '180,183', '2', '0', 'PO_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('184', '导出', '180', '180,184', '2', '0', 'PO_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('185', '打印', '180', '180,185', '2', '0', 'PO_PRINT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('186', '审核', '180', '180,186', '2', '0', 'PO_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('187', '反审核', '180', '180,187', '2', '0', 'PO_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('188', '销售订单', '0', '188', '1', '0', 'SO_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('189', '新增', '188', '188,189', '2', '0', 'SO_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('190', '修改', '188', '188,190', '2', '0', 'SO_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('191', '删除', '188', '188,191', '2', '0', 'SO_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('192', '导出', '188', '188,192', '2', '0', 'SO_EXPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('193', '打印', '188', '188,193', '2', '0', 'SO_PRINT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('194', '审核', '188', '188,194', '2', '0', 'SO_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('195', '反审核', '188', '188,195', '2', '0', 'SO_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('196', '审核', '144', '144,196', '2', '0', 'TF_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('197', '反审核', '144', '144,197', '2', '0', 'TF_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('198', '审核', '124', '124,198', '2', '0', 'RECEIPT_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('199', '反审核', '124', '124,199', '2', '0', 'RECEIPT_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('200', '审核', '129', '129,200', '2', '0', 'PAYMENT_CHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('201', '反审核', '129', '129,201', '2', '0', 'PAYMENT_UNCHECK', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('202', '库存预警', '0', '202', '1', '0', 'INVENTORY_WARNING', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('203', '客户等级', '0', '203', '1', '0', 'CL_QUERY', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('204', '新增', '203', '203, 204', '2', '0', 'CL_ADD', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('205', '修改', '203', '203, 205', '2', '0', 'CL_UPDATE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('206', '删除', '203', '203, 206', '2', '0', 'CL_DELETE', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('207', '导入', '68', '68,207', '2', '100', 'INVENTORY_IMPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('208', '导入', '58', '58,208', '2', '100', 'BU_IMPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('209', '导入', '63', '63,209', '2', '100', 'PUR_IMPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('210', '导入', '167', '167,210', '2', '0', 'TRADETYPE_IMPORT', '1', 'trade', '1', '0', '0', '');
INSERT INTO `ci_menu` VALUES ('211', '导出', '167', '167,211', '2', '0', 'TRADETYPE_EXPORT', '1', 'trade', '1', '0', '0', '');

-- ----------------------------
-- Table structure for `ci_options`
-- ----------------------------
DROP TABLE IF EXISTS `ci_options`;
CREATE TABLE `ci_options` (
  `option_id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `option_name` varchar(64) NOT NULL DEFAULT '',
  `option_value` longtext NOT NULL,
  `autoload` varchar(20) NOT NULL DEFAULT 'yes',
  PRIMARY KEY (`option_id`),
  UNIQUE KEY `option_name` (`option_name`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_options
-- ----------------------------
INSERT INTO `ci_options` VALUES ('1', 'system', 'a:10:{s:11:\"companyName\";s:18:\"某某集团公司\";s:11:\"companyAddr\";s:6:\"123213\";s:5:\"phone\";s:5:\"12312\";s:3:\"fax\";s:3:\"312\";s:8:\"postcode\";s:4:\"3123\";s:9:\"qtyPlaces\";s:1:\"1\";s:11:\"pricePlaces\";s:1:\"1\";s:12:\"amountPlaces\";s:1:\"2\";s:10:\"valMethods\";s:13:\"movingAverage\";s:18:\"requiredCheckStore\";s:1:\"1\";}', 'yes');
INSERT INTO `ci_options` VALUES ('2', 'sales', 's:3893:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":60,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"nameExt\":\"<span id=\\\"barCodeInsert\\\">扫描枪录入</span>\",\"width\":300,\"classes\":\"goods\",\"editable\":true,\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"skuName\",\"label\":\"属性\",\"width\":100,\"classes\":\"ui-ellipsis\",\"hidden\":true,\"defLabel\":\"属性\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":80,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"单位\"},{\"name\":\"unitId\",\"label\":\"单位Id\",\"hidden\":true,\"defLabel\":\"单位Id\",\"defhidden\":true},{\"name\":\"locationName\",\"label\":\"仓库\",\"nameExt\":\"<small id=\\\"batchStorage\\\">(批量)</small>\",\"width\":100,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"仓库\"},{\"name\":\"batch\",\"label\":\"批次\",\"width\":90,\"classes\":\"ui-ellipsis batch\",\"hidden\":true,\"title\":false,\"editable\":true,\"align\":\"left\",\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"批次\",\"defhidden\":true},{\"name\":\"prodDate\",\"label\":\"生产日期\",\"width\":90,\"hidden\":true,\"title\":false,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{},\"defLabel\":\"生产日期\",\"defhidden\":true},{\"name\":\"safeDays\",\"label\":\"保质期(天)\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"保质期(天)\",\"defhidden\":true},{\"name\":\"validDate\",\"label\":\"有效期至\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"有效期至\",\"defhidden\":true},{\"name\":\"qty\",\"label\":\"数量\",\"width\":80,\"align\":\"right\",\"formatter\":\"number\",\"formatoptions\":{\"decimalPlaces\":1},\"editable\":true,\"defLabel\":\"数量\"},{\"name\":\"price\",\"label\":\"销售单价\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":1},\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"销售单价\",\"defhidden\":false},{\"name\":\"discountRate\",\"label\":\"折扣率(%)\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"integer\",\"editable\":true,\"defLabel\":\"折扣率(%)\",\"defhidden\":false},{\"name\":\"deduction\",\"label\":\"折扣额\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"折扣额\",\"defhidden\":false},{\"name\":\"amount\",\"label\":\"销售金额\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"销售金额\",\"defhidden\":false},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"},{\"name\":\"srcOrderEntryId\",\"label\":\"源单分录ID\",\"width\":0,\"hidden\":true,\"defLabel\":\"源单分录ID\",\"defhidden\":true},{\"name\":\"srcOrderId\",\"label\":\"源单ID\",\"width\":0,\"hidden\":true,\"defLabel\":\"源单ID\",\"defhidden\":true},{\"name\":\"srcOrderNo\",\"label\":\"源单号\",\"width\":120,\"fixed\":true,\"hidden\":true,\"defLabel\":\"源单号\",\"defhidden\":true}],\"colModel\":[[\"operating\",\" \",null,60],[\"goods\",\"商品\",null,300],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"locationName\",\"仓库\",null,100],[\"batch\",\"批次\",true,90],[\"prodDate\",\"生产日期\",true,90],[\"safeDays\",\"保质期(天)\",true,90],[\"validDate\",\"有效期至\",true,90],[\"qty\",\"数量\",null,80],[\"price\",\"销售单价\",false,100],[\"discountRate\",\"折扣率(%)\",false,70],[\"deduction\",\"折扣额\",false,70],[\"amount\",\"销售金额\",false,100],[\"description\",\"备注\",null,150],[\"srcOrderEntryId\",\"源单分录ID\",true,0],[\"srcOrderId\",\"源单ID\",true,0],[\"srcOrderNo\",\"源单号\",true,120]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('3', 'purchase', 's:797:\"{\"grids\":{\"grid\":{\"colModel\":[[\"operating\",\" \",null,60],[\"pic\",\"商品图片\",null,77],[\"goods\",\"商品\",null,300],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"locationName\",\"仓库\",null,100],[\"batch\",\"批次\",true,90],[\"prodDate\",\"生产日期\",true,90],[\"safeDays\",\"保质期(天)\",true,90],[\"validDate\",\"有效期至\",true,90],[\"qty\",\"数量\",null,80],[\"price\",\"购货单价\",false,100],[\"discountRate\",\"折扣率(%)\",false,70],[\"deduction\",\"折扣额\",false,70],[\"amount\",\"购货金额\",false,100],[\"description\",\"备注\",null,150],[\"srcOrderEntryId\",\"源单分录ID\",true,0],[\"srcOrderId\",\"源单ID\",true,0],[\"srcOrderNo\",\"源单号\",true,120]],\"isReg\":true}},\"curTime\":1441963732000,\"modifyTime\":1441963732000}\";', 'yes');
INSERT INTO `ci_options` VALUES ('4', 'transfers', 's:2702:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":40,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"width\":318,\"title\":false,\"classes\":\"goods\",\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"skuName\",\"label\":\"属性\",\"width\":100,\"classes\":\"ui-ellipsis\",\"hidden\":true,\"defLabel\":\"属性\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":80,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"单位\"},{\"name\":\"unitId\",\"label\":\"单位Id\",\"hidden\":true,\"defLabel\":\"单位Id\",\"defhidden\":true},{\"name\":\"batch\",\"label\":\"批次\",\"width\":90,\"classes\":\"ui-ellipsis batch\",\"hidden\":true,\"title\":false,\"editable\":true,\"align\":\"left\",\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"批次\",\"defhidden\":true},{\"name\":\"prodDate\",\"label\":\"生产日期\",\"width\":90,\"hidden\":true,\"title\":false,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{},\"defLabel\":\"生产日期\",\"defhidden\":true},{\"name\":\"safeDays\",\"label\":\"保质期(天)\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"保质期(天)\",\"defhidden\":true},{\"name\":\"validDate\",\"label\":\"有效期至\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"有效期至\",\"defhidden\":true},{\"name\":\"qty\",\"label\":\"数量\",\"width\":80,\"align\":\"right\",\"formatter\":\"number\",\"formatoptions\":{\"decimalPlaces\":1},\"editable\":true,\"defLabel\":\"数量\"},{\"name\":\"outLocationName\",\"label\":\"调出仓库\",\"nameExt\":\"<small id=\\\"batch-storageA\\\">(批量)</small>\",\"sortable\":false,\"width\":100,\"title\":true,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"调出仓库\"},{\"name\":\"inLocationName\",\"label\":\"调入仓库\",\"nameExt\":\"<small id=\\\"batch-storageB\\\">(批量)</small>\",\"width\":100,\"title\":true,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"调入仓库\"},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"}],\"colModel\":[[\"operating\",\" \",null,40],[\"goods\",\"商品\",null,318],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"batch\",\"批次\",true,90],[\"prodDate\",\"生产日期\",true,90],[\"safeDays\",\"保质期(天)\",true,90],[\"validDate\",\"有效期至\",true,90],[\"qty\",\"数量\",null,80],[\"outLocationName\",\"调出仓库\",null,100],[\"inLocationName\",\"调入仓库\",null,100],[\"description\",\"备注\",null,150]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('5', 'otherWarehouse', 's:2906:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":40,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"width\":320,\"title\":true,\"classes\":\"goods\",\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"skuName\",\"label\":\"属性\",\"width\":100,\"classes\":\"ui-ellipsis\",\"hidden\":true,\"defLabel\":\"属性\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":80,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"单位\"},{\"name\":\"unitId\",\"label\":\"单位Id\",\"hidden\":true,\"defLabel\":\"单位Id\",\"defhidden\":true},{\"name\":\"locationName\",\"label\":\"仓库\",\"nameExt\":\"<small id=\\\"batchStorage\\\">(批量)</small>\",\"width\":100,\"title\":true,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"仓库\"},{\"name\":\"batch\",\"label\":\"批次\",\"width\":90,\"classes\":\"ui-ellipsis batch\",\"hidden\":true,\"title\":false,\"editable\":true,\"align\":\"left\",\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"批次\",\"defhidden\":true},{\"name\":\"prodDate\",\"label\":\"生产日期\",\"width\":90,\"hidden\":true,\"title\":false,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{},\"defLabel\":\"生产日期\",\"defhidden\":true},{\"name\":\"safeDays\",\"label\":\"保质期(天)\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"保质期(天)\",\"defhidden\":true},{\"name\":\"validDate\",\"label\":\"有效期至\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"有效期至\",\"defhidden\":true},{\"name\":\"qty\",\"label\":\"数量\",\"width\":80,\"align\":\"right\",\"formatter\":\"number\",\"formatoptions\":{\"decimalPlaces\":1},\"editable\":true,\"defLabel\":\"数量\"},{\"name\":\"price\",\"label\":\"入库单价\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":1},\"editable\":true,\"defLabel\":\"入库单价\",\"defhidden\":false},{\"name\":\"amount\",\"label\":\"入库金额\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"入库金额\",\"defhidden\":false},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"}],\"colModel\":[[\"operating\",\" \",null,40],[\"goods\",\"商品\",null,320],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"locationName\",\"仓库\",null,100],[\"batch\",\"批次\",true,90],[\"prodDate\",\"生产日期\",true,90],[\"safeDays\",\"保质期(天)\",true,90],[\"validDate\",\"有效期至\",true,90],[\"qty\",\"数量\",null,80],[\"price\",\"入库单价\",false,100],[\"amount\",\"入库金额\",false,100],[\"description\",\"备注\",null,150]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('6', 'adjustment', 's:1337:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":40,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"width\":320,\"title\":true,\"classes\":\"goods\",\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis disableSku\"},\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":60,\"defLabel\":\"单位\"},{\"name\":\"amount\",\"label\":\"调整金额\",\"hidden\":false,\"width\":100,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"调整金额\",\"defhidden\":false},{\"name\":\"locationName\",\"label\":\"仓库<small id=\\\"batchStorage\\\">(批量)</small>\",\"width\":100,\"title\":true,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"仓库<small id=\\\"batchStorage\\\">(批量)</small>\"},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"}],\"colModel\":[[\"operating\",\" \",null,40],[\"goods\",\"商品\",null,320],[\"skuId\",\"属性ID\",true,null],[\"mainUnit\",\"单位\",null,60],[\"amount\",\"调整金额\",false,100],[\"locationName\",\"仓库<small id=\\\"batchStorage\\\">(批量)</small>\",null,100],[\"description\",\"备注\",null,150]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('7', 'purchaseBack', 's:3824:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":60,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"nameExt\":\"<span id=\\\"barCodeInsert\\\">扫描枪录入</span>\",\"width\":300,\"classes\":\"goods\",\"editable\":true,\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"skuName\",\"label\":\"属性\",\"width\":100,\"classes\":\"ui-ellipsis\",\"hidden\":true,\"defLabel\":\"属性\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":80,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"单位\"},{\"name\":\"unitId\",\"label\":\"单位Id\",\"hidden\":true,\"defLabel\":\"单位Id\",\"defhidden\":true},{\"name\":\"locationName\",\"label\":\"仓库\",\"nameExt\":\"<small id=\\\"batchStorage\\\">(批量)</small>\",\"width\":100,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"仓库\"},{\"name\":\"batch\",\"label\":\"批次\",\"width\":90,\"classes\":\"ui-ellipsis batch\",\"hidden\":true,\"title\":false,\"editable\":true,\"align\":\"left\",\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"批次\",\"defhidden\":true},{\"name\":\"prodDate\",\"label\":\"生产日期\",\"width\":90,\"hidden\":true,\"title\":false,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{},\"defLabel\":\"生产日期\",\"defhidden\":true},{\"name\":\"safeDays\",\"label\":\"保质期(天)\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"保质期(天)\",\"defhidden\":true},{\"name\":\"validDate\",\"label\":\"有效期至\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"有效期至\",\"defhidden\":true},{\"name\":\"qty\",\"label\":\"数量\",\"width\":80,\"align\":\"right\",\"formatter\":\"number\",\"formatoptions\":{\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"数量\"},{\"name\":\"price\",\"label\":\"购货单价\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"购货单价\",\"defhidden\":false},{\"name\":\"discountRate\",\"label\":\"折扣率(%)\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"integer\",\"editable\":true,\"defLabel\":\"折扣率(%)\",\"defhidden\":false},{\"name\":\"deduction\",\"label\":\"折扣额\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"折扣额\",\"defhidden\":false},{\"name\":\"amount\",\"label\":\"购货金额\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"购货金额\",\"defhidden\":false},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"},{\"name\":\"srcOrderEntryId\",\"label\":\"源单分录ID\",\"width\":0,\"hidden\":true,\"defLabel\":\"源单分录ID\",\"defhidden\":true},{\"name\":\"srcOrderId\",\"label\":\"源单ID\",\"width\":0,\"hidden\":true,\"defLabel\":\"源单ID\",\"defhidden\":true},{\"name\":\"srcOrderNo\",\"label\":\"源单号\",\"width\":120,\"fixed\":true,\"hidden\":true,\"defLabel\":\"源单号\",\"defhidden\":true}],\"colModel\":[[\"operating\",\" \",null,60],[\"goods\",\"商品\",null,300],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"locationName\",\"仓库\",null,100],[\"batch\",\"批次\",true,90],[\"prodDate\",\"生产日期\",true,90],[\"safeDays\",\"保质期(天)\",true,90],[\"validDate\",\"有效期至\",true,90],[\"qty\",\"数量\",null,80],[\"price\",\"购货单价\",false,100],[\"discountRate\",\"折扣率(%)\",false,70],[\"deduction\",\"折扣额\",false,70],[\"amount\",\"购货金额\",false,100],[\"description\",\"备注\",null,150],[\"srcOrderEntryId\",\"源单分录ID\",true,0],[\"srcOrderId\",\"源单ID\",true,0],[\"srcOrderNo\",\"源单号\",true,120]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('8', 'salesBack', 's:3893:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":60,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"nameExt\":\"<span id=\\\"barCodeInsert\\\">扫描枪录入</span>\",\"width\":300,\"classes\":\"goods\",\"editable\":true,\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"skuName\",\"label\":\"属性\",\"width\":100,\"classes\":\"ui-ellipsis\",\"hidden\":true,\"defLabel\":\"属性\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":80,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"单位\"},{\"name\":\"unitId\",\"label\":\"单位Id\",\"hidden\":true,\"defLabel\":\"单位Id\",\"defhidden\":true},{\"name\":\"locationName\",\"label\":\"仓库\",\"nameExt\":\"<small id=\\\"batchStorage\\\">(批量)</small>\",\"width\":100,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"仓库\"},{\"name\":\"batch\",\"label\":\"批次\",\"width\":90,\"classes\":\"ui-ellipsis batch\",\"hidden\":true,\"title\":false,\"editable\":true,\"align\":\"left\",\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"批次\",\"defhidden\":true},{\"name\":\"prodDate\",\"label\":\"生产日期\",\"width\":90,\"hidden\":true,\"title\":false,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{},\"defLabel\":\"生产日期\",\"defhidden\":true},{\"name\":\"safeDays\",\"label\":\"保质期(天)\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"保质期(天)\",\"defhidden\":true},{\"name\":\"validDate\",\"label\":\"有效期至\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"有效期至\",\"defhidden\":true},{\"name\":\"qty\",\"label\":\"数量\",\"width\":80,\"align\":\"right\",\"formatter\":\"number\",\"formatoptions\":{\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"数量\"},{\"name\":\"price\",\"label\":\"销售单价\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"销售单价\",\"defhidden\":false},{\"name\":\"discountRate\",\"label\":\"折扣率(%)\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"integer\",\"editable\":true,\"defLabel\":\"折扣率(%)\",\"defhidden\":false},{\"name\":\"deduction\",\"label\":\"折扣额\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"折扣额\",\"defhidden\":false},{\"name\":\"amount\",\"label\":\"销售金额\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"销售金额\",\"defhidden\":false},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"},{\"name\":\"srcOrderEntryId\",\"label\":\"源单分录ID\",\"width\":0,\"hidden\":true,\"defLabel\":\"源单分录ID\",\"defhidden\":true},{\"name\":\"srcOrderId\",\"label\":\"源单ID\",\"width\":0,\"hidden\":true,\"defLabel\":\"源单ID\",\"defhidden\":true},{\"name\":\"srcOrderNo\",\"label\":\"源单号\",\"width\":120,\"fixed\":true,\"hidden\":true,\"defLabel\":\"源单号\",\"defhidden\":true}],\"colModel\":[[\"operating\",\" \",null,60],[\"goods\",\"商品\",null,300],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"locationName\",\"仓库\",null,100],[\"batch\",\"批次\",true,90],[\"prodDate\",\"生产日期\",true,90],[\"safeDays\",\"保质期(天)\",true,90],[\"validDate\",\"有效期至\",true,90],[\"qty\",\"数量\",null,80],[\"price\",\"销售单价\",false,100],[\"discountRate\",\"折扣率(%)\",false,70],[\"deduction\",\"折扣额\",false,70],[\"amount\",\"销售金额\",false,100],[\"description\",\"备注\",null,150],[\"srcOrderEntryId\",\"源单分录ID\",true,0],[\"srcOrderId\",\"源单ID\",true,0],[\"srcOrderNo\",\"源单号\",true,120]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('9', 'otherOutbound', 's:2892:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":40,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"width\":320,\"title\":true,\"classes\":\"goods\",\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"skuName\",\"label\":\"属性\",\"width\":100,\"classes\":\"ui-ellipsis\",\"hidden\":true,\"defLabel\":\"属性\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":80,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"单位\"},{\"name\":\"unitId\",\"label\":\"单位Id\",\"hidden\":true,\"defLabel\":\"单位Id\",\"defhidden\":true},{\"name\":\"locationName\",\"label\":\"仓库\",\"nameExt\":\"<small id=\\\"batchStorage\\\">(批量)</small>\",\"width\":100,\"title\":true,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"仓库\"},{\"name\":\"batch\",\"label\":\"批次\",\"width\":90,\"classes\":\"ui-ellipsis batch\",\"hidden\":true,\"title\":false,\"editable\":true,\"align\":\"left\",\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-ellipsis\"},\"defLabel\":\"批次\",\"defhidden\":true},{\"name\":\"prodDate\",\"label\":\"生产日期\",\"width\":90,\"hidden\":true,\"title\":false,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{},\"defLabel\":\"生产日期\",\"defhidden\":true},{\"name\":\"safeDays\",\"label\":\"保质期(天)\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"保质期(天)\",\"defhidden\":true},{\"name\":\"validDate\",\"label\":\"有效期至\",\"width\":90,\"hidden\":true,\"title\":false,\"align\":\"left\",\"defLabel\":\"有效期至\",\"defhidden\":true},{\"name\":\"qty\",\"label\":\"数量\",\"width\":80,\"align\":\"right\",\"formatter\":\"number\",\"formatoptions\":{\"decimalPlaces\":1},\"editable\":true,\"defLabel\":\"数量\"},{\"name\":\"price\",\"label\":\"出库单位成本\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":1},\"defLabel\":\"出库单位成本\",\"defhidden\":false},{\"name\":\"amount\",\"label\":\"出库成本\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"defLabel\":\"出库成本\",\"defhidden\":false},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"}],\"colModel\":[[\"operating\",\" \",null,40],[\"goods\",\"商品\",null,320],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"locationName\",\"仓库\",null,100],[\"batch\",\"批次\",true,90],[\"prodDate\",\"生产日期\",true,90],[\"safeDays\",\"保质期(天)\",true,90],[\"validDate\",\"有效期至\",true,90],[\"qty\",\"数量\",null,80],[\"price\",\"出库单位成本\",false,100],[\"amount\",\"出库成本\",false,100],[\"description\",\"备注\",null,150]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('10', 'purchaseOrder', 's:2682:\"{\"grids\":{\"grid\":{\"defColModel\":[{\"name\":\"operating\",\"label\":\" \",\"width\":60,\"fixed\":true,\"align\":\"center\",\"defLabel\":\" \"},{\"name\":\"goods\",\"label\":\"商品\",\"nameExt\":\"<span id=\\\"barCodeInsert\\\">扫描枪录入</span>\",\"width\":300,\"classes\":\"goods\",\"editable\":true,\"defLabel\":\"商品\"},{\"name\":\"skuId\",\"label\":\"属性ID\",\"hidden\":true,\"defLabel\":\"属性ID\",\"defhidden\":true},{\"name\":\"skuName\",\"label\":\"属性\",\"width\":100,\"classes\":\"ui-ellipsis\",\"hidden\":true,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"属性\",\"defhidden\":true},{\"name\":\"mainUnit\",\"label\":\"单位\",\"width\":80,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"单位\"},{\"name\":\"unitId\",\"label\":\"单位Id\",\"hidden\":true,\"defLabel\":\"单位Id\",\"defhidden\":true},{\"name\":\"locationName\",\"label\":\"仓库\",\"nameExt\":\"<small id=\\\"batchStorage\\\">(批量)</small>\",\"width\":100,\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"仓库\"},{\"name\":\"qty\",\"label\":\"数量\",\"width\":80,\"align\":\"right\",\"formatter\":\"number\",\"formatoptions\":{\"decimalPlaces\":1},\"editable\":true,\"defLabel\":\"数量\"},{\"name\":\"price\",\"label\":\"购货单价\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":1},\"editable\":true,\"edittype\":\"custom\",\"editoptions\":{\"trigger\":\"ui-icon-triangle-1-s\"},\"defLabel\":\"购货单价\",\"defhidden\":false},{\"name\":\"discountRate\",\"label\":\"折扣率(%)\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"integer\",\"editable\":true,\"defLabel\":\"折扣率(%)\",\"defhidden\":false},{\"name\":\"deduction\",\"label\":\"折扣额\",\"hidden\":false,\"width\":70,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"折扣额\",\"defhidden\":false},{\"name\":\"amount\",\"label\":\"购货金额\",\"hidden\":false,\"width\":100,\"fixed\":true,\"align\":\"right\",\"formatter\":\"currency\",\"formatoptions\":{\"showZero\":true,\"decimalPlaces\":2},\"editable\":true,\"defLabel\":\"购货金额\",\"defhidden\":false},{\"name\":\"description\",\"label\":\"备注\",\"width\":150,\"title\":true,\"editable\":true,\"defLabel\":\"备注\"}],\"colModel\":[[\"operating\",\" \",null,60],[\"goods\",\"商品\",null,300],[\"skuId\",\"属性ID\",true,null],[\"skuName\",\"属性\",true,100],[\"mainUnit\",\"单位\",null,80],[\"unitId\",\"单位Id\",true,null],[\"locationName\",\"仓库\",null,100],[\"qty\",\"数量\",null,80],[\"price\",\"购货单价\",false,100],[\"discountRate\",\"折扣率(%)\",false,70],[\"deduction\",\"折扣额\",false,70],[\"amount\",\"购货金额\",false,100],[\"description\",\"备注\",null,150]],\"isReg\":true}}}\";', 'yes');
INSERT INTO `ci_options` VALUES ('11', 'salesOrderList', 's:606:\"{\"grids\":{\"grid\":{\"colModel\":[[\"operating\",\"操作\",null,60],[\"billDate\",\"订单日期\",null,100],[\"billNo\",\"订单编号\",null,120],[\"transType\",\"业务类别\",null,100],[\"salesName\",\"销售人员\",null,80],[\"contactName\",\"客户\",null,101],[\"totalAmount\",\"销售金额\",false,100],[\"totalQty\",\"数量\",null,57],[\"billStatusName\",\"订单状态\",null,71],[\"deliveryDate\",\"交货日期\",null,100],[\"userName\",\"制单人\",null,80],[\"checkName\",\"审核人\",false,44],[\"description\",\"备注\",null,200],[\"disEditable\",\"不可编辑\",true,null]],\"isReg\":true}},\"curTime\":1438079315000,\"modifyTime\":1438079315000}\";', 'yes');

-- ----------------------------
-- Table structure for `ci_order`
-- ----------------------------
DROP TABLE IF EXISTS `ci_order`;
CREATE TABLE `ci_order` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `buId` smallint(6) DEFAULT '0' COMMENT '供应商ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '单据编号',
  `uid` smallint(6) DEFAULT '0',
  `userName` varchar(50) DEFAULT '' COMMENT '制单人',
  `transType` int(11) DEFAULT '0' COMMENT '150501购货 150502退货 150601销售 150602退销 150706其他入库',
  `totalAmount` double DEFAULT '0' COMMENT '购货总金额',
  `amount` double DEFAULT '0' COMMENT '折扣后金额',
  `rpAmount` double DEFAULT '0' COMMENT '本次付款',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `description` varchar(100) DEFAULT '' COMMENT '备注',
  `arrears` double DEFAULT '0' COMMENT '本次欠款',
  `disRate` double DEFAULT '0' COMMENT '折扣率',
  `disAmount` double DEFAULT '0' COMMENT '折扣金额',
  `totalQty` double DEFAULT '0' COMMENT '总数量',
  `totalArrears` double DEFAULT '0',
  `billStatus` tinyint(1) DEFAULT '0' COMMENT '订单状态 ',
  `checkName` varchar(50) DEFAULT '' COMMENT '采购单审核人',
  `totalTax` double DEFAULT '0',
  `totalTaxAmount` double DEFAULT '0',
  `checked` tinyint(1) DEFAULT '0' COMMENT '采购单状态',
  `accId` tinyint(4) DEFAULT '0' COMMENT '结算账户ID',
  `billType` varchar(20) DEFAULT '' COMMENT 'PO采购订单 OI其他入库 PUR采购入库 BAL初期余额',
  `modifyTime` datetime DEFAULT NULL COMMENT '更新时间',
  `hxStateCode` tinyint(4) DEFAULT '0' COMMENT '0未付款  1部分付款  2全部付款',
  `transTypeName` varchar(20) DEFAULT '',
  `totalDiscount` double DEFAULT '0',
  `salesId` smallint(6) DEFAULT '0' COMMENT '销售人员ID',
  `customerFree` double DEFAULT '0' COMMENT '客户承担费用',
  `hxAmount` double DEFAULT '0' COMMENT '本次核销金额',
  `hasCheck` double DEFAULT '0' COMMENT '已核销',
  `notCheck` double DEFAULT '0' COMMENT '未核销',
  `nowCheck` double DEFAULT '0' COMMENT '本次核销',
  `payment` double DEFAULT '0' COMMENT '本次预收款',
  `discount` double DEFAULT '0' COMMENT '整单折扣',
  `postData` text COMMENT '提交订单明细 ',
  `locationId` varchar(255) DEFAULT '',
  `inLocationId` varchar(255) DEFAULT '' COMMENT '调入仓库ID多个,分割',
  `outLocationId` varchar(255) DEFAULT '' COMMENT '调出仓库ID多个,分割',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '1删除  0正常',
  `deliveryDate` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `accId` (`accId`),
  KEY `buId` (`buId`),
  KEY `salesId` (`salesId`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;


-- ----------------------------
-- Table structure for `ci_order_info`
-- ----------------------------
DROP TABLE IF EXISTS `ci_order_info`;
CREATE TABLE `ci_order_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `iid` int(11) DEFAULT '0' COMMENT '关联ID',
  `buId` smallint(6) DEFAULT '0' COMMENT '供应商ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '单据编号',
  `transType` int(11) DEFAULT '0' COMMENT '150501采购 150502退货',
  `amount` double DEFAULT '0' COMMENT '购货金额',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `description` varchar(50) DEFAULT '' COMMENT '备注',
  `invId` int(11) DEFAULT '0' COMMENT '商品ID',
  `price` double DEFAULT '0' COMMENT '单价',
  `deduction` double DEFAULT '0' COMMENT '折扣额',
  `discountRate` double DEFAULT '0' COMMENT '折扣率',
  `qty` double DEFAULT '0' COMMENT '数量',
  `locationId` smallint(6) DEFAULT '0',
  `tax` double DEFAULT '0',
  `taxRate` double DEFAULT '0',
  `taxAmount` double DEFAULT '0',
  `unitId` smallint(6) DEFAULT '0',
  `uid` int(11) DEFAULT '0',
  `skuId` int(11) DEFAULT '0',
  `entryId` tinyint(1) DEFAULT '1' COMMENT '区分调拨单  进和出',
  `transTypeName` varchar(25) DEFAULT '',
  `srcOrderEntryId` int(11) DEFAULT '0',
  `srcOrderId` int(11) DEFAULT '0',
  `srcOrderNo` varchar(25) DEFAULT '',
  `billType` varchar(20) DEFAULT '',
  `salesId` smallint(6) DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0' COMMENT '1删除 0正常',
  PRIMARY KEY (`id`),
  KEY `type` (`transType`),
  KEY `billdate` (`billDate`),
  KEY `invId` (`invId`) USING BTREE,
  KEY `transType` (`transType`),
  KEY `iid` (`iid`),
  KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=133 DEFAULT CHARSET=utf8;


-- ----------------------------
-- Table structure for `ci_payment_info`
-- ----------------------------
DROP TABLE IF EXISTS `ci_payment_info`;
CREATE TABLE `ci_payment_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `iid` int(11) DEFAULT '0' COMMENT '关联ID',
  `buId` smallint(6) DEFAULT '0' COMMENT '客户ID',
  `billId` int(11) DEFAULT '0' COMMENT '销售单号ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '销售单编号',
  `billType` varchar(20) DEFAULT '',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `billPrice` double DEFAULT '0' COMMENT '单据金额',
  `hasCheck` double DEFAULT '0' COMMENT '已收款',
  `notCheck` double DEFAULT '0' COMMENT '未收款',
  `nowCheck` double DEFAULT '0' COMMENT '本次收款',
  `transType` varchar(50) DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `type,billdate` (`billDate`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_payment_info
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_printtemplates`
-- ----------------------------
DROP TABLE IF EXISTS `ci_printtemplates`;
CREATE TABLE `ci_printtemplates` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT '',
  `info` text,
  `type` int(11) DEFAULT '0',
  `isDefault` tinyint(1) DEFAULT '0',
  `isSystem` tinyint(1) DEFAULT '0',
  `filePath` varchar(255) DEFAULT NULL,
  `level` int(11) DEFAULT '0',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_printtemplates
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_receipt_info`
-- ----------------------------
DROP TABLE IF EXISTS `ci_receipt_info`;
CREATE TABLE `ci_receipt_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `iid` int(11) DEFAULT '0' COMMENT '关联ID',
  `buId` smallint(6) DEFAULT '0' COMMENT '客户ID',
  `billId` int(11) DEFAULT '0' COMMENT '销售单号ID',
  `billNo` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '销售单编号',
  `billType` varchar(20) DEFAULT '',
  `billDate` date DEFAULT NULL COMMENT '单据日期',
  `billPrice` double DEFAULT '0' COMMENT '单据金额',
  `hasCheck` double DEFAULT '0' COMMENT '已收款',
  `notCheck` double DEFAULT '0' COMMENT '未收款',
  `nowCheck` double DEFAULT '0' COMMENT '本次收款',
  `transType` varchar(50) DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `type,billdate` (`billDate`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_receipt_info
-- ----------------------------

-- ----------------------------
-- Table structure for `ci_staff`
-- ----------------------------
DROP TABLE IF EXISTS `ci_staff`;
CREATE TABLE `ci_staff` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT COMMENT '导航栏目',
  `name` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目名称',
  `number` varchar(15) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '0',
  `disable` tinyint(1) DEFAULT '0' COMMENT '0启用  1禁用',
  `allowsms` tinyint(4) DEFAULT '0',
  `birthday` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `commissionrate` tinyint(4) DEFAULT '0',
  `creatorId` int(11) DEFAULT '0',
  `deptId` int(11) DEFAULT '0',
  `description` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `email` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `empId` int(11) DEFAULT '0',
  `empType` tinyint(4) DEFAULT '1',
  `fullId` int(11) DEFAULT '0',
  `leftDate` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `mobile` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `parentId` smallint(6) DEFAULT NULL,
  `sex` tinyint(4) DEFAULT NULL,
  `userName` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `number` (`number`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `ci_storage`
-- ----------------------------
DROP TABLE IF EXISTS `ci_storage`;
CREATE TABLE `ci_storage` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT COMMENT '导航栏目',
  `name` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '栏目名称',
  `locationNo` varchar(15) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '0',
  `disable` tinyint(1) DEFAULT '0' COMMENT '状态 0正常  1锁定',
  `allowNeg` tinyint(4) DEFAULT '0',
  `deptId` int(11) DEFAULT '0',
  `empId` int(11) DEFAULT '0',
  `groupx` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `phone` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `type` tinyint(4) DEFAULT '0',
  `address` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `isDelete` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `id` (`id`),
  KEY `locationNo` (`locationNo`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `ci_unit`
-- ----------------------------
DROP TABLE IF EXISTS `ci_unit`;
CREATE TABLE `ci_unit` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '客户名称',
  `status` tinyint(1) DEFAULT '1' COMMENT '状态',
  `unitTypeId` smallint(6) DEFAULT '0',
  `default` tinyint(1) DEFAULT '0',
  `rate` tinyint(1) DEFAULT '0',
  `guid` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `ci_unittype`
-- ----------------------------
DROP TABLE IF EXISTS `ci_unittype`;
CREATE TABLE `ci_unittype` (
  `id` smallint(6) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT '' COMMENT '客户名称',
  `status` tinyint(1) DEFAULT '1' COMMENT '状态',
  `isDelete` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ci_unittype
-- ----------------------------
